#pragma once

/**
 * Name: Dead_Island_2
 * Version: 3.0.0.1103923
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum DeadIsland.ECombatState
	 */
	enum class ECombatState : uint8_t
	{
		Calm   = 0,
		Alert  = 1,
		Search = 2,
		Combat = 3,
		MAX    = 4
	};

	/**
	 * Enum DeadIsland.ECosmeticCombatState
	 */
	enum class ECosmeticCombatState : uint8_t
	{
		Calm   = 0,
		Alert  = 1,
		Combat = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.ETransmittableStatus
	 */
	enum class ETransmittableStatus : uint8_t
	{
		None        = 0,
		Electrified = 1,
		Burning     = 2,
		Count       = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadIsland.EGoalEvent
	 */
	enum class EGoalEvent : uint8_t
	{
		Prioritised      = 0,
		Deprioritised    = 1,
		AchievementBegin = 2,
		AchievementEnd   = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadIsland.EAccumulatingEffectType
	 */
	enum class EAccumulatingEffectType : uint8_t
	{
		Burning      = 0,
		Electrocuted = 1,
		Corroded     = 2,
		Bleed        = 3,
		Weakened     = 4,
		Disoriented  = 5,
		Frozen       = 6,
		MAX          = 7
	};

	/**
	 * Enum DeadIsland.EReloadHandlerState
	 */
	enum class EReloadHandlerState : uint8_t
	{
		Idle               = 0,
		StillReloading     = 1,
		CompletedReloading = 2,
		FailedToReload     = 3,
		MAX                = 4
	};

	/**
	 * Enum DeadIsland.ECharacterAutoAlignResult
	 */
	enum class ECharacterAutoAlignResult : uint8_t
	{
		Success     = 0,
		Cancelled   = 1,
		TimeOut     = 2,
		MaxDistance = 3,
		Blocked     = 4,
		Error       = 5,
		MAX         = 6
	};

	/**
	 * Enum DeadIsland.EAccumulatingEffectScalingPolicy
	 */
	enum class EAccumulatingEffectScalingPolicy : uint8_t
	{
		None                         = 0,
		ScaledBasedOnInstigatorLevel = 1,
		ScaledBasedOnWeaponLevel     = 2,
		MAX                          = 3
	};

	/**
	 * Enum DeadIsland.EDamageLevelScalingPolicy
	 */
	enum class EDamageLevelScalingPolicy : uint8_t
	{
		None                                         = 0,
		ScaledToInstigatorLevel                      = 1,
		ScaledToInstigatorLevelFallbackToVictimLevel = 2,
		ScaledToInstigatorLevelFallbackToHostLevel   = 3,
		ScaledToVictimLevel                          = 4,
		ScaledToVictimLevelFallbackToHostLevel       = 5,
		ScaledToHostLevel                            = 6,
		ScaledToWeaponLevelFallbackToVictimLevel     = 7,
		MAX                                          = 8
	};

	/**
	 * Enum DeadIsland.EPhysicalizedWorldAffectedActorsPolicy
	 */
	enum class EPhysicalizedWorldAffectedActorsPolicy : uint8_t
	{
		CuratedAndDynamic = 0,
		CuratedOnly       = 1,
		DynamicOnly       = 2,
		Count             = 3,
		MAX               = 4
	};

	/**
	 * Enum DeadIsland.EImpactGameplayCategory
	 */
	enum class EImpactGameplayCategory : uint8_t
	{
		None           = 0,
		Melee          = 1,
		Ranged         = 2,
		Environmental  = 3,
		Thrown         = 4,
		Character      = 5,
		Explosion      = 6,
		DamageOverTime = 7,
		Count          = 8,
		MAX            = 9
	};

	/**
	 * Enum DeadIsland.EImpactRequestNetworkPolicy
	 */
	enum class EImpactRequestNetworkPolicy : uint8_t
	{
		LocalOnly           = 0,
		All                 = 1,
		AllExceptInstigator = 2,
		AllExceptVictim     = 3,
		MAX                 = 4
	};

	/**
	 * Enum DeadIsland.EImpactNotificationType
	 */
	enum class EImpactNotificationType : uint8_t
	{
		IncomingImpact = 0,
		OutgoingImpact = 1,
		MAX            = 2
	};

	/**
	 * Enum DeadIsland.EBodyPartGameplayState
	 */
	enum class EBodyPartGameplayState : uint8_t
	{
		Standard    = 0,
		Dead        = 1,
		Broken      = 2,
		Dismembered = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadIsland.EClassAbilityState
	 */
	enum class EClassAbilityState : uint8_t
	{
		Used       = 0,
		Successful = 1,
		Perfect    = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EPlayerMinigameResult
	 */
	enum class EPlayerMinigameResult : uint8_t
	{
		None      = 0,
		Passed    = 1,
		Failed    = 2,
		Cancelled = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadIsland.EPlayerMinigameStageResult
	 */
	enum class EPlayerMinigameStageResult : uint8_t
	{
		Passed = 0,
		Failed = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EHUDFuryUseResult
	 */
	enum class EHUDFuryUseResult : uint8_t
	{
		Success_ForcedFury = 0,
		Success_FullFury   = 1,
		Failure            = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EMeleeWeaponDurability
	 */
	enum class EMeleeWeaponDurability : uint8_t
	{
		Full         = 0,
		Good         = 1,
		Used         = 2,
		Poor         = 3,
		AlmostBroken = 4,
		Broken       = 5,
		MAX          = 6
	};

	/**
	 * Enum DeadIsland.EUIItemBackgroundStyle
	 */
	enum class EUIItemBackgroundStyle : uint8_t
	{
		Weapon = 0,
		Other  = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EItemRepresentationType
	 */
	enum class EItemRepresentationType : uint8_t
	{
		None      = 0,
		Archetype = 1,
		Actor     = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EHUDHealthPackUseResult
	 */
	enum class EHUDHealthPackUseResult : uint8_t
	{
		Success            = 0,
		Failure_NoPacks    = 1,
		Failure_FullHealth = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EHealthRechargeCancelReason
	 */
	enum class EHealthRechargeCancelReason : uint8_t
	{
		None                 = 0,
		FullHealth           = 1,
		TakeDamage           = 2,
		HealthRechargeLocked = 3,
		MAX                  = 4
	};

	/**
	 * Enum DeadIsland.EFastTravelInstanceType
	 */
	enum class EFastTravelInstanceType : uint8_t
	{
		NotSet      = 0,
		Activation  = 1,
		Destination = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EPlayerMinigamePhaseResult
	 */
	enum class EPlayerMinigamePhaseResult : uint8_t
	{
		Passed = 0,
		Failed = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EInteractionMode
	 */
	enum class EInteractionMode : uint8_t
	{
		Invalid  = 0,
		Use      = 1,
		Overload = 2,
		Count    = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EInteractInterruptReason
	 */
	enum class EInteractInterruptReason : uint8_t
	{
		UserReleased  = 0,
		UserDamaged   = 1,
		OutOfRange    = 2,
		BecameInvalid = 3,
		Count         = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadIsland.EDockRequestSource
	 */
	enum class EDockRequestSource : uint8_t
	{
		None        = 0,
		Setup       = 1,
		Progression = 2,
		Persistence = 3,
		User        = 4,
		Replication = 5,
		Destroyed   = 6,
		MAX         = 7
	};

	/**
	 * Enum DeadIsland.EDockStateChangeSource
	 */
	enum class EDockStateChangeSource : uint8_t
	{
		None        = 0,
		Setup       = 1,
		Progression = 2,
		Persistence = 3,
		User        = 4,
		Replication = 5,
		MAX         = 6
	};

	/**
	 * Enum DeadIsland.EGatherState
	 */
	enum class EGatherState : uint8_t
	{
		None        = 0,
		NotGathered = 1,
		Gathered    = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EQuestUIState
	 */
	enum class EQuestUIState : uint8_t
	{
		None      = 0,
		Available = 1,
		Started   = 2,
		Complete  = 3,
		Failed    = 4,
		Count     = 5,
		MAX       = 6
	};

	/**
	 * Enum DeadIsland.EUIAudioTriggerEvent
	 */
	enum class EUIAudioTriggerEvent : uint8_t
	{
		INVALID                                        = 0,
		MenuConfirm                                    = 1,
		MenuMovement                                   = 2,
		MenuBack                                       = 3,
		MenuConfirmPositive                            = 4,
		MenuConfirmNegative                            = 5,
		MenuSwitchTab                                  = 6,
		MenuOpen                                       = 7,
		MenuClose                                      = 8,
		MenuPlayerOpen                                 = 9,
		MenuPlayerClose                                = 10,
		MenuPause                                      = 11,
		MenuPurchase                                   = 12,
		MenuBigEvent                                   = 13,
		MenuCraftLoop                                  = 14,
		MenuCraftEndSuccess                            = 15,
		MenuCraftEndFail                               = 16,
		MenuScrapLoop                                  = 17,
		MenuScrapEndSuccess                            = 18,
		MenuScrapEndFail                               = 19,
		MenuRepairLoop                                 = 20,
		MenuRepairEndSuccess                           = 21,
		MenuRepairEndFail                              = 22,
		MenuLevelMatchLoop                             = 23,
		MenuLevelMatchEndSuccess                       = 24,
		MenuLevelMatchEndFail                          = 25,
		MenuSkillTreeUpgrade                           = 26,
		MenuSkillTreeRespec                            = 27,
		MenuSkillTreeUpgradeFail                       = 28,
		MenuSkillTreeEnter                             = 29,
		MenuSkillTreeEnterCardSelectionView            = 30,
		MenuSkillTreeLeaveCardSelectionView            = 31,
		MenuSkillTreeEnterAutophageMeter               = 32,
		MenuSkillTreeLeaveAutophageMeter               = 33,
		MenuSkillTreeNewSlotUnlocked                   = 34,
		MenuSkillTreeNewCardsInSlotUnlocked            = 35,
		MenuSkillTreeNewSlotUpdate                     = 36,
		MenuSkillTreeNewCard                           = 37,
		MenuSkillTreeAssignCard                        = 38,
		MenuSkillTreeUnAssignCard                      = 39,
		MenuCharSelectLoop                             = 40,
		MenuCharSelectEndLoop                          = 41,
		MenuCharSelectMoveCharacter                    = 42,
		MenuCharSelectConfirmCharacter                 = 43,
		MenuMapHighlight                               = 44,
		MenuMapSnapTo                                  = 45,
		MenuInventoryWeaponDrop                        = 46,
		MenuInventoryDetails                           = 47,
		MenuInventoryStartSwap                         = 48,
		MenuInventoryDoSwap                            = 49,
		MenuInventoryDoSwapWithEmpty                   = 50,
		MenuDetailsModelViewBegin                      = 51,
		MenuDetailsModelViewEnd                        = 52,
		MenuDetailsEnterStatBreakdown                  = 53,
		MenuDetailsLeaveStatBreakdown                  = 54,
		MenuVendorPopUpValueChange                     = 55,
		MenuQuestTrackQuest                            = 56,
		MenuContextualNotificationTutorial             = 57,
		MenuPopUpOpened                                = 58,
		MenuPopUpClosed                                = 59,
		MenuPopUpConfirmed                             = 60,
		MenuPopUpCancel                                = 61,
		MenuPopUpSpecialOpened                         = 62,
		MenuPopUpSpecialClosed                         = 63,
		MenuOptionSwitchToggle                         = 64,
		MenuOptionSliderChange                         = 65,
		MenuSplashScreenConfirm                        = 66,
		MenuContinueGamePlay                           = 67,
		HUDCentralNotificationThrowable                = 68,
		HUDCentralNotificationAbilitySkill             = 69,
		HUDFailScreenIntro                             = 70,
		HUDLoadingSceneEnterGame                       = 71,
		HUDIncreaseXP                                  = 72,
		HUDLevelUp                                     = 73,
		HUDObjectiveNew                                = 74,
		HUDMissionStarted                              = 75,
		HUDMissionCompleted                            = 76,
		HUDMissionFailed                               = 77,
		HUDMissionObjective                            = 78,
		HUDMissionStartAbandoning                      = 79,
		HUDMissionStopAbandoning                       = 80,
		HUDFuryOneShotReady                            = 81,
		HUDFuryFullReady                               = 82,
		HUDFuryFullCancel                              = 83,
		HUDHealthMedkitNoneLeft                        = 84,
		HUDHealthMedkitFullHealth                      = 85,
		HUDOpenWeaponWheel                             = 86,
		HUDCloseWeaponWheel                            = 87,
		HUDSpinWeaponWheel                             = 88,
		HUDSelectWeaponWheel                           = 89,
		HUDWheelDropWeapon                             = 90,
		HUDOpenEmoteWheel                              = 91,
		HUDCloseEmoteWheel                             = 92,
		HUDSpinEmoteWheel                              = 93,
		HUDSelectEmoteWheel                            = 94,
		HUDQuestTrackQuest                             = 95,
		HUDThrowablesCooldownEnd                       = 96,
		HUDContextualNotificationJournal               = 97,
		HUDContextualNotificationBlueprint             = 98,
		HUDContextualNotificationSkillCard             = 99,
		HUDContextualNotificationTutorial              = 100,
		HUDContextualNotificationCodex                 = 101,
		HUDContextualNotificationTrackedBlueprint      = 102,
		HUDContextualNotificationChallengeUpdate       = 103,
		HUDContextualNotificationChallengeTierComplete = 104,
		HUDContextualNotificationChallengeComplete     = 105,
		Count                                          = 106,
		MAX                                            = 107
	};

	/**
	 * Enum DeadIsland.EObjectiveUIState
	 */
	enum class EObjectiveUIState : uint8_t
	{
		None     = 0,
		Started  = 1,
		Complete = 2,
		Failed   = 3,
		Stopped  = 4,
		Waiting  = 5,
		MAX      = 6
	};

	/**
	 * Enum DeadIsland.EShotHandlerState
	 */
	enum class EShotHandlerState : uint8_t
	{
		Idle            = 0,
		PreparingToFire = 1,
		Firing          = 2,
		OutOfAmmo       = 3,
		CompletedFiring = 4,
		Error           = 5,
		MAX             = 6
	};

	/**
	 * Enum DeadIsland.EAimDownSightsHandlerState
	 */
	enum class EAimDownSightsHandlerState : uint8_t
	{
		Inactive   = 0,
		ZoomingIn  = 1,
		Zoomed     = 2,
		ZoomingOut = 3,
		MAX        = 4
	};

	/**
	 * Enum DeadIsland.EMissionOutcome
	 */
	enum class EMissionOutcome : uint8_t
	{
		MissionSuccess = 0,
		MissionFailure = 1,
		SessionFailure = 2,
		SessionVictory = 3,
		Pending        = 4,
		MAX            = 5
	};

	/**
	 * Enum DeadIsland.EObjectiveOutcome
	 */
	enum class EObjectiveOutcome : uint8_t
	{
		ObjectiveSuccess = 0,
		ObjectiveFailure = 1,
		MAX              = 2
	};

	/**
	 * Enum DeadIsland.EScenarioLightTime
	 */
	enum class EScenarioLightTime : uint8_t
	{
		Day     = 0,
		Night   = 1,
		Unknown = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.ESkillTreePurchaseResult
	 */
	enum class ESkillTreePurchaseResult : uint8_t
	{
		Successful                     = 0,
		TierRequirementsNotMet         = 1,
		RequiresHigherProgressionLevel = 2,
		CannotAfford                   = 3,
		AlreadyHave                    = 4,
		UnhandledFail                  = 5,
		MAX                            = 6
	};

	/**
	 * Enum DeadIsland.ESkillTreeDeactivateResult
	 */
	enum class ESkillTreeDeactivateResult : uint8_t
	{
		Successful    = 0,
		DoNotHave     = 1,
		UnhandledFail = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.ESkillAssignChangeReason
	 */
	enum class ESkillAssignChangeReason : uint8_t
	{
		Assigned   = 0,
		Unassigned = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.EBlueprintTrackedState
	 */
	enum class EBlueprintTrackedState : uint8_t
	{
		None                = 0,
		RequiresIngredients = 1,
		NearestWorkbench    = 2,
		MAX                 = 3
	};

	/**
	 * Enum DeadIsland.EItemIconDurabilityState
	 */
	enum class EItemIconDurabilityState : uint8_t
	{
		Unitialised = 0,
		Good        = 1,
		Low         = 2,
		LastFewHits = 3,
		Broken      = 4,
		MAX         = 5
	};

	/**
	 * Enum DeadIsland.EAccumulatingEffectRecipient
	 */
	enum class EAccumulatingEffectRecipient : uint8_t
	{
		Player    = 0,
		DefaultAI = 1,
		Specials  = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EAccumulatingEffectState
	 */
	enum class EAccumulatingEffectState : uint8_t
	{
		Accumulating = 0,
		Active       = 1,
		Paused       = 2,
		Idle         = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadIsland.EActionSequencerSubActionEarlyFinishResponse
	 */
	enum class EActionSequencerSubActionEarlyFinishResponse : uint8_t
	{
		EndMainAction        = 0,
		SkipToLastAction     = 1,
		ContinueToNextAction = 2,
		MAX                  = 3
	};

	/**
	 * Enum DeadIsland.EProjectileCreationParameterSource
	 */
	enum class EProjectileCreationParameterSource : uint8_t
	{
		Explicit           = 0,
		ParameterGenerator = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.EAISpawnerMode
	 */
	enum class EAISpawnerMode : uint8_t
	{
		InFront  = 0,
		InRadius = 1,
		Anywhere = 2,
		Count    = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EAimCorrectionStartMethod
	 */
	enum class EAimCorrectionStartMethod : uint8_t
	{
		RequiresActionBegin = 0,
		StartOnBegin        = 1,
		MAX                 = 2
	};

	/**
	 * Enum DeadIsland.EAIMeleeSubAction
	 */
	enum class EAIMeleeSubAction : uint8_t
	{
		None            = 0,
		InvisibleWindUp = 1,
		VariableWindUp  = 2,
		FixedWindUp     = 3,
		Attack          = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadIsland.ECurrentAmmoState
	 */
	enum class ECurrentAmmoState : uint8_t
	{
		AmmoFull              = 0,
		AmmoPartiallyDepleted = 1,
		AmmoEmpty             = 2,
		MAX                   = 3
	};

	/**
	 * Enum DeadIsland.EAmmoHandlerTransactionType
	 */
	enum class EAmmoHandlerTransactionType : uint8_t
	{
		QueryOnly          = 0,
		ProcessTransaction = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.EAmmoHandlerConsumeResult
	 */
	enum class EAmmoHandlerConsumeResult : uint8_t
	{
		AmmoConsumeFailed_NotEnoughAmmo = 0,
		AmmoConsumeSuccess              = 1,
		AmmoConsumePartialSuccess       = 2,
		MAX                             = 3
	};

	/**
	 * Enum DeadIsland.EAmmoHandlerRefillResult
	 */
	enum class EAmmoHandlerRefillResult : uint8_t
	{
		AmmoRefillFailed_NotEnoughAmmo     = 0,
		AmmoRefillFailed_AlreadyAtCapacity = 1,
		AmmoRefillSuccess                  = 2,
		AmmoRefillPartialSuccess           = 3,
		MAX                                = 4
	};

	/**
	 * Enum DeadIsland.EValidationRequirement
	 */
	enum class EValidationRequirement : uint8_t
	{
		NoRequirement = 0,
		MustBeTrue    = 1,
		MustBeFalse   = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.ENavigationState
	 */
	enum class ENavigationState : uint8_t
	{
		Idle              = 0,
		FindingPath       = 1,
		FollowingPath     = 2,
		PathFindingFailed = 3,
		MAX               = 4
	};

	/**
	 * Enum DeadIsland.EStrafeMode
	 */
	enum class EStrafeMode : uint8_t
	{
		None   = 0,
		Strafe = 1,
		Aim    = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum DeadIsland.EStuckReason
	 */
	enum class EStuckReason : uint8_t
	{
		None       = 0,
		OffNavMesh = 1,
		Movement   = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.ELocomotionVolatileState
	 */
	enum class ELocomotionVolatileState : uint8_t
	{
		None               = 0,
		MaintainNavigation = 1,
		ClearNavigation    = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.ELookAtDebugMode
	 */
	enum class ELookAtDebugMode : uint8_t
	{
		RadiusLookAt = 0,
		InputLookAt  = 1,
		FollowPawn   = 2,
		Count        = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadIsland.ECosmeticEffectAnimNotifyObjectContext
	 */
	enum class ECosmeticEffectAnimNotifyObjectContext : uint8_t
	{
		None                         = 0,
		Character_ObjectSetComponent = 1,
		Weapon_ObjectSetComponent    = 2,
		MAX                          = 3
	};

	/**
	 * Enum DeadIsland.ETriggerDialogueNotifyTriggerType
	 */
	enum class ETriggerDialogueNotifyTriggerType : uint8_t
	{
		Self   = 0,
		Nearby = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EDistanceAttackCorrectionMode
	 */
	enum class EDistanceAttackCorrectionMode : uint8_t
	{
		Enabled_AddRootMotion = 0,
		Enabled               = 1,
		Disabled              = 2,
		MAX                   = 3
	};

	/**
	 * Enum DeadIsland.EMontagePlayEvent
	 */
	enum class EMontagePlayEvent : uint8_t
	{
		Action_OnBegin = 0,
		UserDefined    = 1,
		MAX            = 2
	};

	/**
	 * Enum DeadIsland.EMontageEndEvent
	 */
	enum class EMontageEndEvent : uint8_t
	{
		MontageEnd         = 0,
		MontageBlendingOut = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.EInAirState
	 */
	enum class EInAirState : uint8_t
	{
		InAirEnter   = 0,
		InAirLoop    = 1,
		InAirLanding = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.ESlideState
	 */
	enum class ESlideState : uint8_t
	{
		SlideEnter = 0,
		SlideLoop  = 1,
		SlideExit  = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EApplyStatusEffectActorType
	 */
	enum class EApplyStatusEffectActorType : uint8_t
	{
		Attacker = 0,
		Victim   = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EMultipleOverlapBehaviour
	 */
	enum class EMultipleOverlapBehaviour : uint8_t
	{
		OnlyApplyFirstInstanceOfType = 0,
		ApplyAlways                  = 1,
		MAX                          = 2
	};

	/**
	 * Enum DeadIsland.ESwayLayer
	 */
	enum class ESwayLayer : uint8_t
	{
		ForwardBack   = 0,
		LeftRight     = 1,
		UpDown        = 2,
		NumSwayLayers = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.ELevelScalingMethod
	 */
	enum class ELevelScalingMethod : uint8_t
	{
		None      = 0,
		Linear    = 1,
		Ranged    = 2,
		Increment = 3,
		Curve     = 4,
		Explicit  = 5,
		Count     = 6,
		MAX       = 7
	};

	/**
	 * Enum DeadIsland.EDefaultValueOverrideType
	 */
	enum class EDefaultValueOverrideType : uint8_t
	{
		Absolute      = 0,
		RandomInRange = 1,
		Count         = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.EAttributeModifierApplicationRule
	 */
	enum class EAttributeModifierApplicationRule : uint8_t
	{
		MultiplyBaseValue        = 0,
		SumWithBaseValue         = 1,
		MultiplyOneOverBaseValue = 2,
		Count                    = 3,
		MAX                      = 4
	};

	/**
	 * Enum DeadIsland.EAttributeValueSource
	 */
	enum class EAttributeValueSource : uint8_t
	{
		Explicit  = 0,
		Attribute = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EDebugObjectClassFlags
	 */
	enum class EDebugObjectClassFlags : uint8_t
	{
		ShowDebugStrings = 0,
		ShowFarCorners   = 1,
		ShowNearCorners  = 2,
		ShowFarCentre    = 3,
		ShowWeaponRadius = 4,
		MAX              = 5
	};

	/**
	 * Enum DeadIsland.EAutoAimAdjustType
	 */
	enum class EAutoAimAdjustType : uint8_t
	{
		Absolute = 0,
		Scalar   = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EDropRequestState
	 */
	enum class EDropRequestState : uint8_t
	{
		None                    = 0,
		CalculatingDropLocation = 1,
		DroppingAtLocation      = 2,
		DropCancelled           = 3,
		Complete                = 4,
		MAX                     = 5
	};

	/**
	 * Enum DeadIsland.ERequestState
	 */
	enum class ERequestState : uint8_t
	{
		None         = 0,
		Initializing = 1,
		Processing   = 2,
		Complete     = 3,
		Cancelled    = 4,
		MAX          = 5
	};

	/**
	 * Enum DeadIsland.EBatchConfigUsage
	 */
	enum class EBatchConfigUsage : uint8_t
	{
		Ambient   = 0,
		Objective = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EPassFailResult
	 */
	enum class EPassFailResult : uint8_t
	{
		Pass = 0,
		Fail = 1,
		MAX  = 2
	};

	/**
	 * Enum DeadIsland.EDamagePropagation
	 */
	enum class EDamagePropagation : uint8_t
	{
		PropagateNotSet         = 0,
		PropagateNever          = 1,
		PropagateAfterPartDeath = 2,
		PropagateAlways         = 3,
		PropagateInstead        = 4,
		MAX                     = 5
	};

	/**
	 * Enum DeadIsland.EFilterRule
	 */
	enum class EFilterRule : uint8_t
	{
		MatchAny = 0,
		MatchAll = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EBoundingBoxGenerationMethod
	 */
	enum class EBoundingBoxGenerationMethod : uint8_t
	{
		AllCollidingComponents   = 0,
		PreferCapsule            = 1,
		PreferPrimitiveComponent = 2,
		MAX                      = 3
	};

	/**
	 * Enum DeadIsland.EBreathingState
	 */
	enum class EBreathingState : uint8_t
	{
		BreathingIn                = 0,
		InterruptedBreathingIn     = 1,
		HoldingBreathIn            = 2,
		BreathingOut               = 3,
		VocalBreathingOut          = 4,
		HoldingBreathOut           = 5,
		ExternalDialoguePlayingOut = 6,
		Dead                       = 7,
		MAX                        = 8
	};

	/**
	 * Enum DeadIsland.EMentalState
	 */
	enum class EMentalState : uint8_t
	{
		Calm    = 0,
		Alerted = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EVocalPlayFlags
	 */
	enum class EVocalPlayFlags : uint8_t
	{
		DyingVocal                                            = 0,
		DontInterruptOtherVocal                               = 1,
		AllowThisDialogueTriggerToBeInterruptedBySamePriority = 2,
		MAX                                                   = 3
	};

	/**
	 * Enum DeadIsland.EVocalPlayType
	 */
	enum class EVocalPlayType : uint8_t
	{
		Uninitialized                = 0,
		InterruptPlayImmediately     = 1,
		InterruptQuickInhaleThenPlay = 2,
		WaitAndPlayOnNextExhale      = 3,
		NumberOfTypes                = 4,
		MAX                          = 5
	};

	/**
	 * Enum DeadIsland.EBreathingEvent
	 */
	enum class EBreathingEvent : uint8_t
	{
		LightExert     = 0,
		Exert          = 1,
		HeavyExert     = 2,
		Vocal          = 3,
		Resurrect      = 4,
		NumberOfEvents = 5,
		MAX            = 6
	};

	/**
	 * Enum DeadIsland.EOffsetCheckPredicate
	 */
	enum class EOffsetCheckPredicate : uint8_t
	{
		AtLeast   = 0,
		AtMost    = 1,
		Same      = 2,
		Different = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadIsland.EOffsetCheckSpace
	 */
	enum class EOffsetCheckSpace : uint8_t
	{
		OriginLocal = 0,
		TargetLocal = 1,
		World       = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EAIDodgeDirectionRelativeToDefender
	 */
	enum class EAIDodgeDirectionRelativeToDefender : uint8_t
	{
		None     = 0,
		Forward  = 1,
		Backward = 2,
		Left     = 3,
		Right    = 4,
		MAX      = 5
	};

	/**
	 * Enum DeadIsland.EAIDodgeDirectionRelativeToAggressor
	 */
	enum class EAIDodgeDirectionRelativeToAggressor : uint8_t
	{
		None  = 0,
		Away  = 1,
		Left  = 2,
		Right = 3,
		MAX   = 4
	};

	/**
	 * Enum DeadIsland.EValueType
	 */
	enum class EValueType : uint8_t
	{
		Absolute           = 0,
		Relative           = 1,
		RelativePercentage = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EModifierType
	 */
	enum class EModifierType : uint8_t
	{
		FieldOfView    = 0,
		CameraAperture = 1,
		FocusDistance  = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadIsland.ECampaignOpenSetting
	 */
	enum class ECampaignOpenSetting : uint8_t
	{
		Always             = 0,
		NotStartedCampaign = 1,
		HasStartedCampaign = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.ECampaignGameType
	 */
	enum class ECampaignGameType : uint8_t
	{
		Local = 0,
		Host  = 1,
		Find  = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadIsland.EFacingCombatTargetType
	 */
	enum class EFacingCombatTargetType : uint8_t
	{
		AgentToCombatTarget = 0,
		CombatTargetToAgent = 1,
		MAX                 = 2
	};

	/**
	 * Enum DeadIsland.ECombatTargetRangeType
	 */
	enum class ECombatTargetRangeType : uint8_t
	{
		RangeToCombatTarget   = 0,
		RangeFromCombatTarget = 1,
		MAX                   = 2
	};

	/**
	 * Enum DeadIsland.ECarryableDetachType
	 */
	enum class ECarryableDetachType : uint8_t
	{
		Drop  = 0,
		Throw = 1,
		Dock  = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadIsland.EChallengeRatingAgentAmount
	 */
	enum class EChallengeRatingAgentAmount : uint8_t
	{
		HighArchetypeCount = 0,
		Balanced           = 1,
		LowArchetypeCount  = 2,
		Max                = 3
	};

	/**
	 * Enum DeadIsland.EChallengeRatingSelection
	 */
	enum class EChallengeRatingSelection : uint8_t
	{
		None          = 0,
		AgentCount    = 1,
		AgentMinMax   = 2,
		EnumSelection = 3,
		Max           = 4
	};

	/**
	 * Enum DeadIsland.ECosplayType
	 */
	enum class ECosplayType : uint8_t
	{
		Base    = 0,
		Premium = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EFadeSkipControlFlags
	 */
	enum class EFadeSkipControlFlags : uint8_t
	{
		SkipIfOutOfView       = 0,
		SkipWhenWorldObscured = 1,
		SkipBasedOnRenderTime = 2,
		MAX                   = 3
	};

	/**
	 * Enum DeadIsland.EProfilePrivilege
	 */
	enum class EProfilePrivilege : uint8_t
	{
		None    = 0,
		Online  = 1,
		Cosplay = 2,
		Count   = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadIsland.EAccountPrivilege
	 */
	enum class EAccountPrivilege : uint8_t
	{
		None         = 0,
		SkipPrologue = 1,
		NewGamePlus  = 2,
		Count        = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadIsland.ECharacterGender
	 */
	enum class ECharacterGender : uint8_t
	{
		Male   = 0,
		Female = 1,
		Count  = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.ECombatStimModifierType
	 */
	enum class ECombatStimModifierType : uint8_t
	{
		Distance                = 0,
		Threat                  = 1,
		ViewAngle               = 2,
		KnowledgeBaseExpression = 3,
		GoalProximity           = 4,
		MAX                     = 5
	};

	/**
	 * Enum DeadIsland.EAttackLocationType
	 */
	enum class EAttackLocationType : uint8_t
	{
		ClaimedLocation  = 0,
		AdjacentLocation = 1,
		MAX              = 2
	};

	/**
	 * Enum DeadIsland.EEngagementRing
	 */
	enum class EEngagementRing : uint8_t
	{
		InnerRing = 0,
		OuterRing = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.ECompassIconHeightState
	 */
	enum class ECompassIconHeightState : uint8_t
	{
		SameLevel = 0,
		Above     = 1,
		Below     = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EConditionalIconDataType
	 */
	enum class EConditionalIconDataType : uint8_t
	{
		Static  = 0,
		Dynamic = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EContextualNotificationQueueCollisionBehaviors
	 */
	enum class EContextualNotificationQueueCollisionBehaviors : uint8_t
	{
		DontAddSelf = 0,
		AddSelf     = 1,
		ReplaceOld  = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EContributionState
	 */
	enum class EContributionState : uint8_t
	{
		Idle         = 0,
		Accumulating = 1,
		CoolingDown  = 2,
		Decaying     = 3,
		Complete     = 4,
		MAX          = 5
	};

	/**
	 * Enum DeadIsland.ECoopRequestResponse
	 */
	enum class ECoopRequestResponse : uint8_t
	{
		Received = 0,
		TimeOut  = 1,
		Refused  = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.ECounterSequenceState
	 */
	enum class ECounterSequenceState : uint8_t
	{
		Null                       = 0,
		PreRequest                 = 1,
		Initialise                 = 2,
		Intro                      = 3,
		MinigameStart              = 4,
		MinigameLoop               = 5,
		MinigameStageComplete      = 6,
		MinigameStageResult_Passed = 7,
		MinigameEnd                = 8,
		Outro                      = 9,
		MAX                        = 10
	};

	/**
	 * Enum DeadIsland.ECounterReplicateState
	 */
	enum class ECounterReplicateState : uint8_t
	{
		Null             = 0,
		MinigameStageEnd = 1,
		MinigameEnd      = 2,
		Outro            = 3,
		DeferredOutro    = 4,
		MAX              = 5
	};

	/**
	 * Enum DeadIsland.ECounterDamageState
	 */
	enum class ECounterDamageState : uint8_t
	{
		Into          = 0,
		Looping       = 1,
		Outro_Success = 2,
		Outro_Failure = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.ECounterOutcomeState
	 */
	enum class ECounterOutcomeState : uint8_t
	{
		Action = 0,
		Push   = 1,
		Kill   = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EGrappleSequenceState
	 */
	enum class EGrappleSequenceState : uint8_t
	{
		Null                       = 0,
		PreRequest                 = 1,
		Initialise                 = 2,
		Intro                      = 3,
		MinigameStart              = 4,
		MinigameLoop               = 5,
		MinigameStageComplete      = 6,
		MinigameStageResult_Failed = 7,
		MinigameEnd_Passed         = 8,
		MinigameEnd_Failed         = 9,
		PlayerJustKilled           = 10,
		InterruptOutro             = 11,
		RecoveryOutro              = 12,
		TerminateTask              = 13,
		MAX                        = 14
	};

	/**
	 * Enum DeadIsland.EGrappleReplicateState
	 */
	enum class EGrappleReplicateState : uint8_t
	{
		Null                 = 0,
		MinigameEnded_Failed = 1,
		MinigameEnded_Passed = 2,
		MinigameStageFailed  = 3,
		PlayerAttacked       = 4,
		MAX                  = 5
	};

	/**
	 * Enum DeadIsland.EPairedHeavyAttackState
	 */
	enum class EPairedHeavyAttackState : uint8_t
	{
		Null       = 0,
		PreRequest = 1,
		Initialise = 2,
		Attack     = 3,
		Outro      = 4,
		MAX        = 5
	};

	/**
	 * Enum DeadIsland.EForceParseCrawlerLocomotionAnimStatesH
	 */
	enum class EForceParseCrawlerLocomotionAnimStatesH : uint8_t
	{
		Nope = 0,
		MAX  = 1
	};

	/**
	 * Enum DeadIsland.EDamageNetworkApplicationPolicy
	 */
	enum class EDamageNetworkApplicationPolicy : uint8_t
	{
		ExecuteOnServer = 0,
		None            = 1,
		MAX             = 2
	};

	/**
	 * Enum DeadIsland.EDecompressionStrength
	 */
	enum class EDecompressionStrength : uint8_t
	{
		None    = 0,
		Gradual = 1,
		Full    = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EPoseBlendMode
	 */
	enum class EPoseBlendMode : uint8_t
	{
		LinearBlend        = 0,
		HermiteCubicSmooth = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.ESpawnHidingState
	 */
	enum class ESpawnHidingState : uint8_t
	{
		Uninitialised = 0,
		Hidden        = 1,
		Visible       = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.ECapsuleMovement
	 */
	enum class ECapsuleMovement : uint8_t
	{
		Free              = 0,
		BlendOverTime     = 1,
		OverrideTransform = 2,
		OverrideLocation  = 3,
		OverrideRotation  = 4,
		MAX               = 5
	};

	/**
	 * Enum DeadIsland.EUnequippableReasons
	 */
	enum class EUnequippableReasons : uint8_t
	{
		None              = 0,
		ItemIsBroken      = 1,
		UserLevelIsTooLow = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadIsland.ETextDrawPoint
	 */
	enum class ETextDrawPoint : uint8_t
	{
		TopCentre    = 0,
		BottomCentre = 1,
		Left         = 2,
		Right        = 3,
		TopLeft      = 4,
		TopRight     = 5,
		BottomLeft   = 6,
		BottomRight  = 7,
		Count        = 8,
		MAX          = 9
	};

	/**
	 * Enum DeadIsland.EDIInventoryType
	 */
	enum class EDIInventoryType : uint8_t
	{
		Main         = 0,
		Stash        = 1,
		LostAndFound = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EItemCreationMethod
	 */
	enum class EItemCreationMethod : uint8_t
	{
		FixedStandardItem    = 0,
		GuidedProceduralItem = 1,
		FixedProceduralItem  = 2,
		CustomCreationMethod = 3,
		Count                = 4,
		MAX                  = 5
	};

	/**
	 * Enum DeadIsland.EUIMissionState
	 */
	enum class EUIMissionState : uint8_t
	{
		None      = 0,
		Available = 1,
		Started   = 2,
		Complete  = 3,
		Failed    = 4,
		MAX       = 5
	};

	/**
	 * Enum DeadIsland.ENavModifierExpansionDirection
	 */
	enum class ENavModifierExpansionDirection : uint8_t
	{
		None      = 0,
		Forwards  = 1,
		Backwards = 2,
		Left      = 3,
		Right     = 4,
		Up        = 5,
		Down      = 6,
		All       = 7,
		MAX       = 8
	};

	/**
	 * Enum DeadIsland.EDIObjectiveTag
	 */
	enum class EDIObjectiveTag : uint8_t
	{
		Cutscene = 0,
		MAX      = 1
	};

	/**
	 * Enum DeadIsland.EDIPaperDollSlot
	 */
	enum class EDIPaperDollSlot : uint8_t
	{
		Weapon           = 0,
		Throwable        = 1,
		PrimaryAugment   = 2,
		SecondaryAugment = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadIsland.EServerTriggerType
	 */
	enum class EServerTriggerType : uint8_t
	{
		DropKick        = 0,
		ExplosiveAttack = 1,
		MAX             = 2
	};

	/**
	 * Enum DeadIsland.ECameraYawContext
	 */
	enum class ECameraYawContext : uint8_t
	{
		Neutral = 0,
		Left    = 1,
		Right   = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.ECameraPitchContext
	 */
	enum class ECameraPitchContext : uint8_t
	{
		Neutral = 0,
		Up      = 1,
		Down    = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EDIQuestlineTag
	 */
	enum class EDIQuestlineTag : uint8_t
	{
		MainQuestline = 0,
		MAX           = 1
	};

	/**
	 * Enum DeadIsland.EFadeMode
	 */
	enum class EFadeMode : uint8_t
	{
		Idle     = 0,
		Linear   = 1,
		Constant = 2,
		PingPong = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EDistractionPrioritisationType
	 */
	enum class EDistractionPrioritisationType : uint8_t
	{
		Newest  = 0,
		Oldest  = 1,
		Closest = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EDLCAdvertisedState
	 */
	enum class EDLCAdvertisedState : uint8_t
	{
		Unadvertised = 0,
		Advertised   = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadIsland.EDLCExaminedState
	 */
	enum class EDLCExaminedState : uint8_t
	{
		Unexamined         = 0,
		Examined           = 1,
		UnexaminedNotified = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EDoorTransparency
	 */
	enum class EDoorTransparency : uint8_t
	{
		Solid       = 0,
		Translucent = 1,
		Transparent = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EDoorAudioLocation
	 */
	enum class EDoorAudioLocation : uint8_t
	{
		Handle    = 0,
		Underside = 1,
		Hinge     = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EDoorType
	 */
	enum class EDoorType : uint8_t
	{
		RotatesOneWay   = 0,
		RotatesBothWays = 1,
		Sliding         = 2,
		Other           = 3,
		MAX             = 4
	};

	/**
	 * Enum DeadIsland.EDoorSwingOrientation
	 */
	enum class EDoorSwingOrientation : uint8_t
	{
		NotApplicable = 0,
		Left          = 1,
		Right         = 2,
		Both          = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.EDoorSwingDirection
	 */
	enum class EDoorSwingDirection : uint8_t
	{
		NotApplicable = 0,
		Toward        = 1,
		Away          = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.EDoorSides
	 */
	enum class EDoorSides : uint8_t
	{
		Left  = 0,
		Right = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadIsland.EArchetypeEvaluationOrder
	 */
	enum class EArchetypeEvaluationOrder : uint8_t
	{
		Linear = 0,
		Random = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EEnvironmentalHazardState
	 */
	enum class EEnvironmentalHazardState : uint8_t
	{
		Active   = 0,
		Inactive = 1,
		Terminal = 2,
		Broken   = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EEngagementRingPointFilter
	 */
	enum class EEngagementRingPointFilter : uint8_t
	{
		None            = 0,
		EdgesAndClosest = 1,
		MAX             = 2
	};

	/**
	 * Enum DeadIsland.ENavMeshEdges_EdgeNormalDirection
	 */
	enum class ENavMeshEdges_EdgeNormalDirection : uint8_t
	{
		Outward           = 0,
		Inward            = 1,
		ENavMeshEdges_MAX = 2
	};

	/**
	 * Enum DeadIsland.EErrorResponseType
	 */
	enum class EErrorResponseType : uint8_t
	{
		Invalid                      = 0,
		ActivityFailed               = 1,
		IncompatibleNetworkVersion   = 2,
		KickPlayer                   = 3,
		AccountTypeFailure           = 4,
		CreateGameFailed             = 5,
		FindGameFailed               = 6,
		FindGameNoHosting            = 7,
		PartyFull                    = 8,
		GameFull                     = 9,
		QuickJoinGameNotInstalled    = 10,
		GameNotInstalled             = 11,
		InvalidSession               = 12,
		InvitePlayerBlocked          = 13,
		InviteCoopNotUnlocked        = 14,
		InviteQuestTooFarAhead       = 15,
		InviteConnectivityTimeout    = 16,
		JoinPartyFailed              = 17,
		JoinPartyGameFailed          = 18,
		InvalidInviteData            = 19,
		PartyLost                    = 20,
		ServerConnectionLost         = 21,
		RequiredPatchAvailable       = 22,
		RequiredSystemUpdate         = 23,
		AgeRestrictionFailure        = 24,
		OnlinePlayRestricted         = 25,
		OnlineSignOut                = 26,
		OnlineServiceConnectionLost  = 27,
		ConnectToOnlineServiceFailed = 28,
		InviteQuestlineUnavailable   = 29,
		QuestTooFarAheadRuntime      = 30,
		Count                        = 31,
		MAX                          = 32
	};

	/**
	 * Enum DeadIsland.EExplosionSurface
	 */
	enum class EExplosionSurface : uint8_t
	{
		Point     = 0,
		Circle    = 1,
		Rectangle = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EOutgoingViewOption
	 */
	enum class EOutgoingViewOption : uint8_t
	{
		Tick         = 0,
		Lock         = 1,
		LockRotation = 2,
		Count        = 3,
		MAX          = 4
	};

	/**
	 * Enum DeadIsland.EFluidMixingResolution
	 */
	enum class EFluidMixingResolution : uint8_t
	{
		Error                 = 0,
		Mix                   = 1,
		MixIfInitialInactive  = 2,
		MixIfIncomingInactive = 3,
		Ignore                = 4,
		Num                   = 5,
		MAX                   = 6
	};

	/**
	 * Enum DeadIsland.EFluidSimProjectileMovementConfig
	 */
	enum class EFluidSimProjectileMovementConfig : uint8_t
	{
		None             = 0,
		Activate         = 1,
		ActivateAndReset = 2,
		Deactivate       = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadIsland.EFluidSimProjectileSimulationConfig
	 */
	enum class EFluidSimProjectileSimulationConfig : uint8_t
	{
		None       = 0,
		Activate   = 1,
		Deactivate = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EFluidRequestType
	 */
	enum class EFluidRequestType : uint8_t
	{
		Environmental = 0,
		PlayerRequest = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadIsland.EFootstepFailedToHandleNotifyReason
	 */
	enum class EFootstepFailedToHandleNotifyReason : uint8_t
	{
		Allowed                 = 0,
		TooSoonSameFoot         = 1,
		TooSoonComponent        = 2,
		TooSoonGlobal           = 3,
		WwiseAudioOutputTooLoud = 4,
		MAX                     = 5
	};

	/**
	 * Enum DeadIsland.EFootstepComponentAttenuationType
	 */
	enum class EFootstepComponentAttenuationType : uint8_t
	{
		DefaultSmall         = 0,
		SpecialLarge         = 1,
		SpecialSmallFrequent = 2,
		MAX                  = 3
	};

	/**
	 * Enum DeadIsland.EFootstepProbeDirection
	 */
	enum class EFootstepProbeDirection : uint8_t
	{
		Gravity                    = 0,
		Forward                    = 1,
		LedgeGrabForwardAndGravity = 2,
		MAX                        = 3
	};

	/**
	 * Enum DeadIsland.EFoleyType
	 */
	enum class EFoleyType : uint8_t
	{
		Locomotion   = 0,
		LedgeGrab    = 1,
		Vault        = 2,
		WeaponAttack = 3,
		ShortMove    = 4,
		LongMove     = 5,
		CrouchIn     = 6,
		CrouchOut    = 7,
		Dodge        = 8,
		BlockIn      = 9,
		BlockOut     = 10,
		CounterIn    = 11,
		CounterOut   = 12,
		MAX          = 13
	};

	/**
	 * Enum DeadIsland.EFootstepType
	 */
	enum class EFootstepType : uint8_t
	{
		Left          = 0,
		Right         = 1,
		Dodge         = 2,
		SlideIn       = 3,
		SlideOut      = 4,
		Jump          = 5,
		Land          = 6,
		CrouchIn      = 7,
		CrouchOut     = 8,
		Knockdown     = 9,
		KnockdownOut  = 10,
		LeftHand      = 11,
		RightHand     = 12,
		LeftHandDrag  = 13,
		RightHandDrag = 14,
		Max           = 15
	};

	/**
	 * Enum DeadIsland.EffectsRegistry
	 */
	enum class EffectsRegistry : uint8_t
	{
		Surface  = 0,
		Material = 1,
		Class    = 2,
		Custom   = 3,
		MaxTypes = 4,
		MAX      = 5
	};

	/**
	 * Enum DeadIsland.EGameCollisionHandlerOverrideResponse
	 */
	enum class EGameCollisionHandlerOverrideResponse : uint8_t
	{
		None                      = 0,
		StopAllEngineNotifies     = 1,
		StopEngineNotifyIfHandled = 2,
		MAX                       = 3
	};

	/**
	 * Enum DeadIsland.EGameCollisionRepsonseEngineNotifyType
	 */
	enum class EGameCollisionRepsonseEngineNotifyType : uint8_t
	{
		kResponsesDecidesNotify = 0,
		kStopEngineNotify       = 1,
		kKeepEngineNotify       = 2,
		MAX                     = 3
	};

	/**
	 * Enum DeadIsland.EGameCollisionEditorResponseType
	 */
	enum class EGameCollisionEditorResponseType : uint8_t
	{
		kAutoInherits = 0,
		kConcrete     = 1,
		kCascade      = 2,
		kCopyFrom     = 3,
		kTypeCount    = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadIsland.EGameCollisionDamageCurveType
	 */
	enum class EGameCollisionDamageCurveType : uint8_t
	{
		kLinear    = 0,
		kSquare    = 1,
		kCustom    = 2,
		kTypeCount = 3,
		MAX        = 4
	};

	/**
	 * Enum DeadIsland.EGameEventAkAudioNetworkType
	 */
	enum class EGameEventAkAudioNetworkType : uint8_t
	{
		LocalOnly = 0,
		Multicast = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EGameEventAkAudioEventLocation
	 */
	enum class EGameEventAkAudioEventLocation : uint8_t
	{
		SceneComponentLocation      = 0,
		SceneComponentAttached      = 1,
		ContextualActorLocation     = 2,
		ContextualActorMeshAttached = 3,
		ProvidedActorLocation       = 4,
		MAX                         = 5
	};

	/**
	 * Enum DeadIsland.EContextualActorFiltering
	 */
	enum class EContextualActorFiltering : uint8_t
	{
		None             = 0,
		LocalActor       = 1,
		Server           = 2,
		SinglePlayerOnly = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadIsland.EGameEventCosmeticEffectLocation
	 */
	enum class EGameEventCosmeticEffectLocation : uint8_t
	{
		SceneComponentLocation  = 0,
		SceneComponentAttached  = 1,
		ContextualActorLocation = 2,
		ContextualActorAttached = 3,
		ArbitraryActorLocation  = 4,
		ArbitraryLocation       = 5,
		MAX                     = 6
	};

	/**
	 * Enum DeadIsland.EGameEventNetworkTriggerRule
	 */
	enum class EGameEventNetworkTriggerRule : uint8_t
	{
		AuthorityOnly = 0,
		LocalOnly     = 1,
		Everyone      = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.EDismembermentType
	 */
	enum class EDismembermentType : uint8_t
	{
		LeftArmMissing           = 0,
		RightArmMissing          = 1,
		BothArmsMissing          = 2,
		BothArmsMissing_CleanCut = 3,
		LeftLegMissing           = 4,
		RightLegMissing          = 5,
		BothLegsMissing          = 6,
		Crawler                  = 7,
		MAX                      = 8
	};

	/**
	 * Enum DeadIsland.ERequestTarget
	 */
	enum class ERequestTarget : uint8_t
	{
		ContextualActor = 0,
		AllPlayers      = 1,
		MAX             = 2
	};

	/**
	 * Enum DeadIsland.EStaminaRewardType
	 */
	enum class EStaminaRewardType : uint8_t
	{
		Percentage = 0,
		Increment  = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.EGameEventAttachmentSelection
	 */
	enum class EGameEventAttachmentSelection : uint8_t
	{
		StaticMesh   = 0,
		SkeletalMesh = 1,
		ActorClass   = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EGameFailPlayerResponse
	 */
	enum class EGameFailPlayerResponse : uint8_t
	{
		None               = 0,
		AllPlayersTeleport = 1,
		AllPlayersRestart  = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EGameFailWorldResponse
	 */
	enum class EGameFailWorldResponse : uint8_t
	{
		None      = 0,
		SoftReset = 1,
		Rollback  = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EGameFailMissionResponse
	 */
	enum class EGameFailMissionResponse : uint8_t
	{
		None     = 0,
		Rollback = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EGameFriendType
	 */
	enum class EGameFriendType : uint8_t
	{
		None     = 0,
		Platform = 1,
		EOS      = 2,
		All      = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EGameMatchmakingTaskType
	 */
	enum class EGameMatchmakingTaskType : uint8_t
	{
		RegisterGameSettings = 0,
		FindGame             = 1,
		JoinPartyGame        = 2,
		LeaveGame            = 3,
		SetGameSettings      = 4,
		MAX                  = 5
	};

	/**
	 * Enum DeadIsland.EReviveInteractType
	 */
	enum class EReviveInteractType : uint8_t
	{
		Invalid   = 0,
		Start     = 1,
		Interrupt = 2,
		Complete  = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadIsland.EGameSequenceDeferredStartMode
	 */
	enum class EGameSequenceDeferredStartMode : uint8_t
	{
		Auto        = 0,
		AlwaysDefer = 1,
		NeverDefer  = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EGameSequenceCompletionMode
	 */
	enum class EGameSequenceCompletionMode : uint8_t
	{
		End           = 0,
		FirstBlendOut = 1,
		Manual        = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.EWaitForReasons
	 */
	enum class EWaitForReasons : uint8_t
	{
		None                       = 0,
		WaitForActorsInitialized   = 1,
		WaitForDiorama             = 2,
		WaitForLightingScenario    = 3,
		WaitForPrepareWorld        = 4,
		WaitForUserInput           = 5,
		WaitForServerReady         = 6,
		WaitForCharacter           = 7,
		WaitForTexturePrecache     = 8,
		WaitForLateTexturePrecache = 9,
		All                        = 10,
		MAX                        = 11
	};

	/**
	 * Enum DeadIsland.EGameStateTransition
	 */
	enum class EGameStateTransition : uint8_t
	{
		Enter   = 0,
		Exit    = 1,
		Suspend = 2,
		Resume  = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadIsland.EGameStateType
	 */
	enum class EGameStateType : uint8_t
	{
		Invalid                 = 0,
		Boot                    = 1,
		Splash                  = 2,
		UserSignIn              = 3,
		ProfileSelect           = 4,
		ProfileCreate           = 5,
		FirstRunOptions         = 6,
		Frontend                = 7,
		TravelRequest           = 8,
		CreateGame              = 9,
		FindGame                = 10,
		JoinPartyGame           = 11,
		Loading                 = 12,
		LoadingScene            = 13,
		PlayingGame             = 14,
		SeamlessTravel          = 15,
		NewGame                 = 16,
		AuthenticateUser        = 17,
		CheckSaveGame           = 18,
		Entry                   = 19,
		ContentEntitlementCheck = 20,
		AuthenticatePros        = 21,
		ProsAccountLink         = 22,
		AgreeToEULA             = 23,
		MarketingTelemetry      = 24,
		LoadGame                = 25,
		ShaderPrecache          = 26,
		HordeFrontend           = 27,
		MAX                     = 28
	};

	/**
	 * Enum DeadIsland.EGameTypeTransition
	 */
	enum class EGameTypeTransition : uint8_t
	{
		None    = 0,
		Offline = 1,
		Online  = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EGasCloudState
	 */
	enum class EGasCloudState : uint8_t
	{
		None            = 0,
		Intro           = 1,
		Sustain         = 2,
		Dissipate       = 3,
		ForcedDissipate = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadIsland.EGatherMode
	 */
	enum class EGatherMode : uint8_t
	{
		Idle   = 0,
		Active = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EGatherContextType
	 */
	enum class EGatherContextType : uint8_t
	{
		None          = 0,
		Gather        = 1,
		FastTravel    = 2,
		QuestDelivery = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.EActionPromptAlignmentScheme
	 */
	enum class EActionPromptAlignmentScheme : uint8_t
	{
		Left          = 0,
		Right         = 1,
		Centred       = 2,
		TypeDependant = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.EAmmoState
	 */
	enum class EAmmoState : uint8_t
	{
		Uninitialized = 0,
		Normal        = 1,
		Low           = 2,
		Empty         = 3,
		Infinite      = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadIsland.EGFxCentralNotificationAbandonStates
	 */
	enum class EGFxCentralNotificationAbandonStates : uint8_t
	{
		Normal      = 0,
		CloseToEdge = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.EChallengeInfoPaneVisbilityFlags
	 */
	enum class EChallengeInfoPaneVisbilityFlags : uint8_t
	{
		None                 = 0,
		ChallengePercentage  = 1,
		PersistantStat       = 2,
		ChallengeSnippets    = 3,
		ChallengeType        = 4,
		ChallengeDescription = 5,
		ChallengeImage       = 6,
		Title                = 7,
		Ingredients          = 8,
		Default              = 9,
		MAX                  = 10
	};

	/**
	 * Enum DeadIsland.EChallengeInfoPaneCentralDisplayState
	 */
	enum class EChallengeInfoPaneCentralDisplayState : uint8_t
	{
		None      = 0,
		Challenge = 1,
		Category  = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EGFxContextualNotificationChallengeAnims
	 */
	enum class EGFxContextualNotificationChallengeAnims : uint8_t
	{
		TierCompleteToNextTier = 0,
		MAX                    = 1
	};

	/**
	 * Enum DeadIsland.ETextTipNotificationStyle
	 */
	enum class ETextTipNotificationStyle : uint8_t
	{
		Menu = 0,
		HUD  = 1,
		MAX  = 2
	};

	/**
	 * Enum DeadIsland.ECoopRosterIconState
	 */
	enum class ECoopRosterIconState : uint8_t
	{
		None       = 0,
		FuryReady  = 1,
		FuryUsed   = 2,
		Dead       = 3,
		Dying      = 4,
		Reviving   = 5,
		Respawning = 6,
		Joining    = 7,
		MAX        = 8
	};

	/**
	 * Enum DeadIsland.EUIDownedIconState
	 */
	enum class EUIDownedIconState : uint8_t
	{
		Normal       = 0,
		Downed       = 1,
		DownedUrgent = 2,
		Reviving     = 3,
		Dead         = 4,
		Respawning   = 5,
		MAX          = 6
	};

	/**
	 * Enum DeadIsland.EGFxHealthBarState
	 */
	enum class EGFxHealthBarState : uint8_t
	{
		HighHealth = 0,
		LowHealth  = 1,
		Dead       = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EItemDisplayTitleTextState
	 */
	enum class EItemDisplayTitleTextState : uint8_t
	{
		Name    = 0,
		Profile = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EInventoryItemRowSwapMarkerState
	 */
	enum class EInventoryItemRowSwapMarkerState : uint8_t
	{
		Off                    = 0,
		SwappingFrom           = 1,
		SwappingTo             = 2,
		SwapPossible           = 3,
		SwapNotPossible        = 4,
		SwapSuccessAnimThenOff = 5,
		MAX                    = 6
	};

	/**
	 * Enum DeadIsland.EGFxItemIconFlags
	 */
	enum class EGFxItemIconFlags : uint8_t
	{
		None         = 0,
		ShowCooldown = 1,
		Default      = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EBlueprintButtonBorderType
	 */
	enum class EBlueprintButtonBorderType : uint8_t
	{
		Default = 0,
		Perk    = 1,
		Mod     = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EMenuOptionKeyState
	 */
	enum class EMenuOptionKeyState : uint8_t
	{
		Valid   = 0,
		Invalid = 1,
		Editing = 2,
		Unset   = 3,
		Count   = 4,
		MAX     = 5
	};

	/**
	 * Enum DeadIsland.ENumericIconBackgroundState
	 */
	enum class ENumericIconBackgroundState : uint8_t
	{
		Normal       = 0,
		Locked       = 1,
		Recolourable = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EUIScoreDisplayType
	 */
	enum class EUIScoreDisplayType : uint8_t
	{
		None   = 0,
		Cash   = 1,
		Attack = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EGFxSkillTreeNodeFlags
	 */
	enum class EGFxSkillTreeNodeFlags : uint8_t
	{
		None           = 0,
		ButtonEvents   = 1,
		CanChangeShape = 2,
		Default        = 3,
		MAX            = 4
	};

	/**
	 * Enum DeadIsland.ESpeakingIconState
	 */
	enum class ESpeakingIconState : uint8_t
	{
		NoVoip   = 0,
		HasVoip  = 1,
		Speaking = 2,
		Muted    = 3,
		Disabled = 4,
		MAX      = 5
	};

	/**
	 * Enum DeadIsland.EXPBarTextFormat
	 */
	enum class EXPBarTextFormat : uint8_t
	{
		CurrentXP     = 0,
		XPToNextLevel = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadIsland.EHandOfGodMode
	 */
	enum class EHandOfGodMode : uint8_t
	{
		PickUp    = 0,
		Slingshot = 1,
		Count     = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EHeavyAttackSequenceState
	 */
	enum class EHeavyAttackSequenceState : uint8_t
	{
		Null                   = 0,
		Lunge                  = 1,
		PreAttack              = 2,
		PairedSequenceAttack   = 3,
		StandardSequenceAttack = 4,
		MAX                    = 5
	};

	/**
	 * Enum DeadIsland.EHitDeathReactionParticipant
	 */
	enum class EHitDeathReactionParticipant : uint8_t
	{
		Defender = 0,
		Attacker = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EHitReactTreeNetworkEvaluationPolicy
	 */
	enum class EHitReactTreeNetworkEvaluationPolicy : uint8_t
	{
		Everyone             = 0,
		ServerOnly           = 1,
		PredictiveClientOnly = 2,
		MAX                  = 3
	};

	/**
	 * Enum DeadIsland.EHitVictimOrientation
	 */
	enum class EHitVictimOrientation : uint8_t
	{
		VictimUpright  = 0,
		VictimFaceUp   = 1,
		VictimFaceDown = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadIsland.EHitDirection
	 */
	enum class EHitDirection : uint8_t
	{
		None     = 0,
		Front90  = 1,
		Back90   = 2,
		Left90   = 3,
		Right90  = 4,
		Front180 = 5,
		Back180  = 6,
		Left180  = 7,
		Right180 = 8,
		Above90  = 9,
		Above180 = 10,
		Below180 = 11,
		Below90  = 12,
		Count    = 13,
		MAX      = 14
	};

	/**
	 * Enum DeadIsland.EHitReactNetworkResolutionResult
	 */
	enum class EHitReactNetworkResolutionResult : uint8_t
	{
		Equivalent  = 0,
		Interrupt   = 1,
		Uncontested = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EHitReactNetworkResolutionBehaviour
	 */
	enum class EHitReactNetworkResolutionBehaviour : uint8_t
	{
		CheckEquivalent  = 0,
		AssumeEquivalent = 1,
		Interrupt        = 2,
		Uncontested      = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadIsland.EHitReactPhase
	 */
	enum class EHitReactPhase : uint8_t
	{
		Uninitialized              = 0,
		Initialized                = 1,
		PreparedResponses          = 2,
		AwaitingResponseCompletion = 3,
		Completed                  = 4,
		Interrupted                = 5,
		Failed                     = 6,
		MAX                        = 7
	};

	/**
	 * Enum DeadIsland.EAccumulationDistributionMethod
	 */
	enum class EAccumulationDistributionMethod : uint8_t
	{
		SumAccumulationAppliedToActorOnSingleImpact = 0,
		AllProjectilesApplyFullAccumulation         = 1,
		DistributeAccumulationEvenly                = 2,
		MAX                                         = 3
	};

	/**
	 * Enum DeadIsland.EForceDistributionMethod
	 */
	enum class EForceDistributionMethod : uint8_t
	{
		SumForceAppliedToActorOnSingleImpact = 0,
		AllProjectilesApplyFullForce         = 1,
		MAX                                  = 2
	};

	/**
	 * Enum DeadIsland.EShotRequestState
	 */
	enum class EShotRequestState : uint8_t
	{
		RequiresProcessing = 0,
		Complete           = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.EHordeCharacterClassType
	 */
	enum class EHordeCharacterClassType : uint8_t
	{
		None            = 0,
		Medic           = 1,
		Hunter          = 2,
		Chemist         = 3,
		UseCurrentClass = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadIsland.EHordeMissionRepetitionType
	 */
	enum class EHordeMissionRepetitionType : uint8_t
	{
		AlwaysRepeatable = 0,
		CompleteOnce     = 1,
		PlayOnce         = 2,
		AvailableOnce    = 3,
		MAX              = 4
	};

	/**
	 * Enum DeadIsland.EHordeMutatorImpact
	 */
	enum class EHordeMutatorImpact : uint8_t
	{
		Neutral  = 0,
		Positive = 1,
		Negative = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EHordeMutatorType
	 */
	enum class EHordeMutatorType : uint8_t
	{
		None        = 0,
		Ambient     = 1,
		Perk        = 2,
		PostProcess = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadIsland.EHordeMutatorBundleGroup
	 */
	enum class EHordeMutatorBundleGroup : uint8_t
	{
		Group_A   = 0,
		Group_B   = 1,
		Group_C   = 2,
		Group_D   = 3,
		Group_E   = 4,
		Group_Max = 5
	};

	/**
	 * Enum DeadIsland.EThreaditorGraphEdgeType
	 */
	enum class EThreaditorGraphEdgeType : uint8_t
	{
		ThreaditorEdge_Success = 0,
		ThreaditorEdge_Failure = 1,
		ThreaditorEdge_MAX     = 2
	};

	/**
	 * Enum DeadIsland.EHordeRewardType
	 */
	enum class EHordeRewardType : uint8_t
	{
		None          = 0,
		Survivors     = 1,
		TrapMaterials = 2,
		Weapons       = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.EHordeObjectiveType
	 */
	enum class EHordeObjectiveType : uint8_t
	{
		None           = 0,
		Boss           = 1,
		Conquest       = 2,
		Fetch          = 3,
		Rescue         = 4,
		ShelterDefense = 5,
		MAX            = 6
	};

	/**
	 * Enum DeadIsland.ESpawnVariation
	 */
	enum class ESpawnVariation : uint8_t
	{
		None  = 0,
		Spike = 1,
		Super = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadIsland.EHUDClusterDefaultBehaviour
	 */
	enum class EHUDClusterDefaultBehaviour : uint8_t
	{
		Off     = 0,
		Dynamic = 1,
		On      = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EHUDClusterParentBehaviour
	 */
	enum class EHUDClusterParentBehaviour : uint8_t
	{
		Both   = 0,
		Either = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EFadeDirection
	 */
	enum class EFadeDirection : uint8_t
	{
		FadeToEffect   = 0,
		FadeFromEffect = 1,
		MAX            = 2
	};

	/**
	 * Enum DeadIsland.EHUDGFxMaintainAspectRatioType
	 */
	enum class EHUDGFxMaintainAspectRatioType : uint8_t
	{
		MaintainHeight = 0,
		MaintainWidth  = 1,
		MaintainBoth   = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadIsland.EHUDGFxAlignment
	 */
	enum class EHUDGFxAlignment : uint8_t
	{
		Custom       = 0,
		TopLeft      = 1,
		TopCenter    = 2,
		TopRight     = 3,
		CenterLeft   = 4,
		Center       = 5,
		CenterRight  = 6,
		BottomLeft   = 7,
		BottomCenter = 8,
		BottomRight  = 9,
		MAX          = 10
	};

	/**
	 * Enum DeadIsland.EHUDIconActorPositionType
	 */
	enum class EHUDIconActorPositionType : uint8_t
	{
		OriginLocation         = 0,
		BBoxCenter             = 1,
		TaggedComponentBBoxTop = 2,
		MAX                    = 3
	};

	/**
	 * Enum DeadIsland.ECoopSignalState
	 */
	enum class ECoopSignalState : uint8_t
	{
		None  = 0,
		Right = 1,
		Left  = 2,
		Clear = 3,
		MAX   = 4
	};

	/**
	 * Enum DeadIsland.EUIStabilityState
	 */
	enum class EUIStabilityState : uint8_t
	{
		None                    = 0,
		Normal                  = 1,
		Unstable                = 2,
		Vulnerable              = 3,
		VulnerableAndRecharging = 4,
		MAX                     = 5
	};

	/**
	 * Enum DeadIsland.EHUDReticleAppearance
	 */
	enum class EHUDReticleAppearance : uint8_t
	{
		None   = 0,
		Cross  = 1,
		Dot    = 2,
		Drop   = 3,
		Circle = 4,
		Sprint = 5,
		Throw  = 6,
		COUNT  = 7,
		MAX    = 8
	};

	/**
	 * Enum DeadIsland.EHordeNotification
	 */
	enum class EHordeNotification : uint8_t
	{
		None      = 0,
		Fancy     = 1,
		Simple    = 2,
		Warning   = 3,
		Distance  = 4,
		Stalker   = 5,
		Objective = 6,
		MAX       = 7
	};

	/**
	 * Enum DeadIsland.EFancyNotificationIcon
	 */
	enum class EFancyNotificationIcon : uint8_t
	{
		None        = 0,
		WaveCleared = 1,
		Survivor    = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.ESuggestedQuestReason
	 */
	enum class ESuggestedQuestReason : uint8_t
	{
		QuestStarted = 0,
		QuestUpdated = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadIsland.EHUDHintPopUpMessageType
	 */
	enum class EHUDHintPopUpMessageType : uint8_t
	{
		Uninitialised        = 0,
		None                 = 1,
		EquippedBrokenWeapon = 2,
		OutOfAmmo            = 3,
		OutOfStamina         = 4,
		WeaponJustBroken     = 5,
		FuryModeReady        = 6,
		MAX                  = 7
	};

	/**
	 * Enum DeadIsland.EBackgroundBarState
	 */
	enum class EBackgroundBarState : uint8_t
	{
		Default        = 0,
		LowHealth      = 1,
		CriticalHealth = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadIsland.EDeltaBarState
	 */
	enum class EDeltaBarState : uint8_t
	{
		Default = 0,
		Loss    = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EHealthBarState
	 */
	enum class EHealthBarState : uint8_t
	{
		Default  = 0,
		Critical = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EPlayerUIRevivalState
	 */
	enum class EPlayerUIRevivalState : uint8_t
	{
		Normal   = 0,
		Downed   = 1,
		Reviving = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EHUDAutoHideType
	 */
	enum class EHUDAutoHideType : uint8_t
	{
		None   = 0,
		Basic  = 1,
		Combat = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EHUDActiveStateType
	 */
	enum class EHUDActiveStateType : uint8_t
	{
		AddToViewport = 0,
		SetVisibility = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadIsland.EIconAnimationFlags
	 */
	enum class EIconAnimationFlags : uint8_t
	{
		None    = 0,
		Show    = 1,
		Hide    = 2,
		Remove  = 3,
		Default = 4,
		MAX     = 5
	};

	/**
	 * Enum DeadIsland.EIconLoaderDefaultCategory
	 */
	enum class EIconLoaderDefaultCategory : uint8_t
	{
		None      = 0,
		Item      = 1,
		Upgrade   = 2,
		Elemental = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadIsland.EImpactEventType
	 */
	enum class EImpactEventType : uint8_t
	{
		General = 0,
		Point   = 1,
		Radial  = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EImpactGroupType
	 */
	enum class EImpactGroupType : uint8_t
	{
		AuthoritativeImpact = 0,
		LocalOnlyImpact     = 1,
		MAX                 = 2
	};

	/**
	 * Enum DeadIsland.EPreventDeathHealthClampMode
	 */
	enum class EPreventDeathHealthClampMode : uint8_t
	{
		ExactValue        = 0,
		NumericExpression = 1,
		MAX               = 2
	};

	/**
	 * Enum DeadIsland.EImpactModificationPriority
	 */
	enum class EImpactModificationPriority : uint8_t
	{
		RemovingImpactProperties  = 0,
		ModifyingImpactProperties = 1,
		AddingImpactProperties    = 2,
		ConvertImpactProperties   = 3,
		MAX                       = 4
	};

	/**
	 * Enum DeadIsland.EIconDisplayPolicy
	 */
	enum class EIconDisplayPolicy : uint8_t
	{
		Never            = 0,
		ModifierLifetime = 1,
		OnImpactModified = 2,
		MAX              = 3
	};

	/**
	 * Enum DeadIsland.EBlockDirectionCalculation
	 */
	enum class EBlockDirectionCalculation : uint8_t
	{
		UseDirectionToImpact   = 0,
		UseDirectionToAttacker = 1,
		MAX                    = 2
	};

	/**
	 * Enum DeadIsland.EAngularLimitCalculation
	 */
	enum class EAngularLimitCalculation : uint8_t
	{
		TestDirectionVictimToImpact             = 0,
		TestDirectionVictimToDamageCausingActor = 1,
		TestDirectionVictimToInstigatorPawn     = 2,
		MAX                                     = 3
	};

	/**
	 * Enum DeadIsland.ESpatialRequirementQueryOriginLocation
	 */
	enum class ESpatialRequirementQueryOriginLocation : uint8_t
	{
		VictimLocation   = 0,
		AttackerLocation = 1,
		MAX              = 2
	};

	/**
	 * Enum DeadIsland.ESensorSweepMethod
	 */
	enum class ESensorSweepMethod : uint8_t
	{
		FromCameraLocationToSensorCenter    = 0,
		FromCameraLocationInCameraDirection = 1,
		Count                               = 2,
		MAX                                 = 3
	};

	/**
	 * Enum DeadIsland.EIngredientSourceType
	 */
	enum class EIngredientSourceType : uint8_t
	{
		None     = 0,
		Zombie   = 1,
		Location = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EInstallationFeatureName
	 */
	enum class EInstallationFeatureName : uint8_t
	{
		MainGame   = 0,
		Horde      = 1,
		Expansion1 = 2,
		Expansion2 = 3,
		MAX        = 4
	};

	/**
	 * Enum DeadIsland.EInteractionTestType
	 */
	enum class EInteractionTestType : uint8_t
	{
		Line   = 0,
		Sweep  = 1,
		NoTest = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EDownloadInProgressContent
	 */
	enum class EDownloadInProgressContent : uint8_t
	{
		NONE       = 0,
		MainGame   = 1,
		Horde      = 2,
		Expansion1 = 3,
		Expansion2 = 4,
		MAX        = 5
	};

	/**
	 * Enum DeadIsland.EInteractionResponseNetworkPolicy
	 */
	enum class EInteractionResponseNetworkPolicy : uint8_t
	{
		Local          = 0,
		Server         = 1,
		LocalAndServer = 2,
		Others         = 3,
		Everybody      = 4,
		MAX            = 5
	};

	/**
	 * Enum DeadIsland.EInteractRangeIconType
	 */
	enum class EInteractRangeIconType : uint8_t
	{
		None        = 0,
		Standard    = 1,
		Counter     = 2,
		Use         = 3,
		Dock        = 4,
		Undock      = 5,
		Repair      = 6,
		Inspect     = 7,
		FastTravel  = 8,
		Locked      = 9,
		Unavailable = 10,
		MAX         = 11
	};

	/**
	 * Enum DeadIsland.EInteractionPriority
	 */
	enum class EInteractionPriority : uint8_t
	{
		Low    = 0,
		Medium = 1,
		High   = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EInteractionResult
	 */
	enum class EInteractionResult : uint8_t
	{
		Invalid             = 0,
		InteractionComplete = 1,
		InteractionBegan    = 2,
		MAX                 = 3
	};

	/**
	 * Enum DeadIsland.EItemRewardResult
	 */
	enum class EItemRewardResult : uint8_t
	{
		Error   = 0,
		Success = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EItemRewardState
	 */
	enum class EItemRewardState : uint8_t
	{
		NotGiven = 0,
		Pending  = 1,
		Received = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EUpgradeCustomisationType
	 */
	enum class EUpgradeCustomisationType : uint8_t
	{
		Customisable = 0,
		Forced       = 1,
		Any          = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EMultipleItemUpgradeRequirementType
	 */
	enum class EMultipleItemUpgradeRequirementType : uint8_t
	{
		AllMustPass        = 0,
		AtLeastOneMustPass = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.EModType
	 */
	enum class EModType : uint8_t
	{
		AcidMod  = 0,
		BleedMod = 1,
		ShockMod = 2,
		FireMod  = 3,
		Max      = 4
	};

	/**
	 * Enum DeadIsland.EItemUpgradePurchaseResult
	 */
	enum class EItemUpgradePurchaseResult : uint8_t
	{
		Success                     = 0,
		Fail_AlreadyBought          = 1,
		Fail_UpgradeTooRare         = 2,
		Fail_ArchetypeLimitExceeded = 3,
		Fail_NotEnoughSlots         = 4,
		Fail_RequirementsNotMet     = 5,
		Fail_NotEnoughCash          = 6,
		Fail_NotEnoughIngredients   = 7,
		Fail_Error                  = 8,
		MAX                         = 9
	};

	/**
	 * Enum DeadIsland.EUpgradeDisplayType
	 */
	enum class EUpgradeDisplayType : uint8_t
	{
		Mod           = 0,
		ModLinkedPerk = 1,
		Perk          = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.EItemUpgradeRequirementsFilter
	 */
	enum class EItemUpgradeRequirementsFilter : uint8_t
	{
		None               = 0,
		RequirementsMet    = 1,
		RequirementsNotMet = 2,
		All                = 3,
		MAX                = 4
	};

	/**
	 * Enum DeadIsland.EJornalImageLayout
	 */
	enum class EJornalImageLayout : uint8_t
	{
		Landscape = 0,
		Portrait  = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EJournalType
	 */
	enum class EJournalType : uint8_t
	{
		Text  = 0,
		Audio = 1,
		Image = 2,
		MAX   = 3
	};

	/**
	 * Enum DeadIsland.EKeyType
	 */
	enum class EKeyType : uint8_t
	{
		Key     = 0,
		Keycard = 1,
		Keycode = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EKeyForLockType
	 */
	enum class EKeyForLockType : uint8_t
	{
		None          = 0,
		Key           = 1,
		Code          = 2,
		Keycard       = 3,
		BiometricCode = 4,
		Clue          = 5,
		MAX           = 6
	};

	/**
	 * Enum DeadIsland.EPlatformSpecificContent
	 */
	enum class EPlatformSpecificContent : uint8_t
	{
		Spoon_Permitted = 0,
		Spoon_Enabled   = 1,
		Spoon_MAX       = 2
	};

	/**
	 * Enum DeadIsland.EQuestRecordOperator
	 */
	enum class EQuestRecordOperator : uint8_t
	{
		Equals             = 0,
		GreaterThanOrEqual = 1,
		GreaterThan        = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EQuestRecordCompleteType
	 */
	enum class EQuestRecordCompleteType : uint8_t
	{
		Host   = 0,
		Client = 1,
		All    = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EMultiplierSpecificationMethod
	 */
	enum class EMultiplierSpecificationMethod : uint8_t
	{
		FixedValue           = 0,
		NumericExpression    = 1,
		RangeBasedExpression = 2,
		MAX                  = 3
	};

	/**
	 * Enum DeadIsland.ERootImpulseSpecificationMethod
	 */
	enum class ERootImpulseSpecificationMethod : uint8_t
	{
		ExplicitImpulseDirection    = 0,
		RadialImpulseOriginLocation = 1,
		MAX                         = 2
	};

	/**
	 * Enum DeadIsland.EAngularImpulseSpecificationMethod
	 */
	enum class EAngularImpulseSpecificationMethod : uint8_t
	{
		ImpulseLocationAndDirection   = 0,
		RadialImpulseOriginLocation   = 1,
		ExplicitPitchAndYawMagnitudes = 2,
		MAX                           = 3
	};

	/**
	 * Enum DeadIsland.EScenarioLightTimeSource
	 */
	enum class EScenarioLightTimeSource : uint8_t
	{
		Progression = 0,
		UserChoice  = 1,
		Count       = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EDefaultVLMSelection
	 */
	enum class EDefaultVLMSelection : uint8_t
	{
		InteriorsDaytimeExteriorsNighttime          = 0,
		SecondaryInteriorsDaytimeExteriorsNighttime = 1,
		AlwaysInteriors                             = 2,
		AlwaysSecondaryInteriors                    = 3,
		AlwaysExteriors                             = 4,
		MAX                                         = 5
	};

	/**
	 * Enum DeadIsland.EArmLimbIKLimbId
	 */
	enum class EArmLimbIKLimbId : uint8_t
	{
		INVALID_KEY = 0,
		LeftArm     = 1,
		RightArm    = 2,
		KEYS_END    = 3,
		KEYS_BEGIN  = 4,
		KEYS_COUNT  = 5,
		MAX         = 6
	};

	/**
	 * Enum DeadIsland.EForceParseLocomotionAnimStatesH
	 */
	enum class EForceParseLocomotionAnimStatesH : uint8_t
	{
		Nope = 0,
		MAX  = 1
	};

	/**
	 * Enum DeadIsland.ELocomotionDebuggerEndMode
	 */
	enum class ELocomotionDebuggerEndMode : uint8_t
	{
		Wait    = 0,
		Release = 1,
		Loop    = 2,
		Count   = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadIsland.ELocomotionDebuggerLocationSource
	 */
	enum class ELocomotionDebuggerLocationSource : uint8_t
	{
		Absolute               = 0,
		RelativeToThisActor    = 1,
		RelativeToContextActor = 2,
		Count                  = 3,
		MAX                    = 4
	};

	/**
	 * Enum DeadIsland.ELocomotionDesiredFacingDirectionSource
	 */
	enum class ELocomotionDesiredFacingDirectionSource : uint8_t
	{
		Invalid                     = 0,
		Current                     = 1,
		Movement                    = 2,
		MoveTargetBasis             = 3,
		ExplicitStrafe              = 4,
		ExplicitAim                 = 5,
		DirectionAtFinalDestination = 6,
		LookAt                      = 7,
		MAX                         = 8
	};

	/**
	 * Enum DeadIsland.EForceRotationType
	 */
	enum class EForceRotationType : uint8_t
	{
		Strafing       = 0,
		Steering       = 1,
		MoveCorrection = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadIsland.ECrawlerLocomotionState
	 */
	enum class ECrawlerLocomotionState : uint8_t
	{
		Idle       = 0,
		Move       = 1,
		TurnOnSpot = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.ELocomotionState
	 */
	enum class ELocomotionState : uint8_t
	{
		Idle         = 0,
		Move         = 1,
		Start        = 2,
		Stop         = 3,
		Pivot        = 4,
		StanceChange = 5,
		TurnOnSpot   = 6,
		MAX          = 7
	};

	/**
	 * Enum DeadIsland.EFoot
	 */
	enum class EFoot : uint8_t
	{
		BlendLeftFoot  = 0,
		BlendRightFoot = 1,
		MAX            = 2
	};

	/**
	 * Enum DeadIsland.ETransition
	 */
	enum class ETransition : uint8_t
	{
		EndStopToMove     = 0,
		EndMoveToStop     = 1,
		EndPivot          = 2,
		EndTurnOnSpot     = 3,
		EndCycleBreak     = 4,
		EndStanceChange   = 5,
		PivotTurningPoint = 6,
		MAX               = 7
	};

	/**
	 * Enum DeadIsland.ELootContainerMapDiscoveryType
	 */
	enum class ELootContainerMapDiscoveryType : uint8_t
	{
		Standard      = 0,
		ZombieLockbox = 1,
		TreasureHunt  = 2,
		FuseRoom      = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.ELootDropBehaviour
	 */
	enum class ELootDropBehaviour : uint8_t
	{
		KillParticipants = 0,
		AnyParticipant   = 1,
		Always           = 2,
		MAX              = 3
	};

	/**
	 * Enum DeadIsland.ELootUpdating
	 */
	enum class ELootUpdating : uint8_t
	{
		None     = 0,
		Override = 1,
		Additive = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EItemUpgradeSpecificationMethod
	 */
	enum class EItemUpgradeSpecificationMethod : uint8_t
	{
		Auto              = 0,
		Explicit          = 1,
		Ranged            = 2,
		NumericExpression = 3,
		Count             = 4,
		MAX               = 5
	};

	/**
	 * Enum DeadIsland.EItemRaritySpecificationMethod
	 */
	enum class EItemRaritySpecificationMethod : uint8_t
	{
		Auto                    = 0,
		InlineWeightingConfig   = 1,
		ExternalWeightingConfig = 2,
		Explicit                = 3,
		Count                   = 4,
		MAX                     = 5
	};

	/**
	 * Enum DeadIsland.EItemLevelSpecificationMethod
	 */
	enum class EItemLevelSpecificationMethod : uint8_t
	{
		Auto                  = 0,
		Explicit              = 1,
		DeltaOnRecipientLevel = 2,
		DeltaOnRequesterLevel = 3,
		Count                 = 4,
		MAX                   = 5
	};

	/**
	 * Enum DeadIsland.ERoundingType
	 */
	enum class ERoundingType : uint8_t
	{
		Floor = 0,
		Ceil  = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadIsland.ERebateType
	 */
	enum class ERebateType : uint8_t
	{
		Fixed      = 0,
		Percentage = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.ELootGenerationState
	 */
	enum class ELootGenerationState : uint8_t
	{
		None               = 0,
		SpawningInProgress = 1,
		Error              = 2,
		SpawningComplete   = 3,
		MAX                = 4
	};

	/**
	 * Enum DeadIsland.ELightingLockedState
	 */
	enum class ELightingLockedState : uint8_t
	{
		LockedIfInProduction = 0,
		Unlocked             = 1,
		Locked               = 2,
		MAX                  = 3
	};

	/**
	 * Enum DeadIsland.EDLCTag
	 */
	enum class EDLCTag : uint8_t
	{
		Dev   = 0,
		Base  = 1,
		Horde = 2,
		DLC1  = 3,
		DLC2  = 4,
		MAX   = 5
	};

	/**
	 * Enum DeadIsland.EGameType
	 */
	enum class EGameType : uint8_t
	{
		Local    = 0,
		FindGame = 1,
		Host     = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EMapDistrictLockedState
	 */
	enum class EMapDistrictLockedState : uint8_t
	{
		NotSet   = 0,
		Locked   = 1,
		Unlocked = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EOverrideBool
	 */
	enum class EOverrideBool : uint8_t
	{
		UseDefault      = 0,
		OverrideToTrue  = 1,
		OverrideToFalse = 2,
		MAX             = 3
	};

	/**
	 * Enum DeadIsland.EAIMeleeHitDetectionSource
	 */
	enum class EAIMeleeHitDetectionSource : uint8_t
	{
		Bones  = 0,
		Weapon = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EMeleeType
	 */
	enum class EMeleeType : uint8_t
	{
		MT_Sweep = 0,
		MT_Stab  = 1,
		MT_MAX   = 2
	};

	/**
	 * Enum DeadIsland.EEvasionState
	 */
	enum class EEvasionState : uint8_t
	{
		None   = 0,
		Evaded = 1,
		Dodged = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EMeleeAttackHitBehaviour
	 */
	enum class EMeleeAttackHitBehaviour : uint8_t
	{
		StopAttackAndAnimation = 0,
		StopAttack             = 1,
		Continue               = 2,
		JumpToSection          = 3,
		PlayMontage            = 4,
		MAX                    = 5
	};

	/**
	 * Enum DeadIsland.ERepeatType
	 */
	enum class ERepeatType : uint8_t
	{
		StaticValue = 0,
		RandomValue = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.EMeleeItemBrokenAttackBehaviour
	 */
	enum class EMeleeItemBrokenAttackBehaviour : uint8_t
	{
		Attack        = 0,
		ThrowOnAttack = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadIsland.EMeleeItemState
	 */
	enum class EMeleeItemState : uint8_t
	{
		Idle           = 0,
		StandardAttack = 1,
		HeavyAttack    = 2,
		Aim            = 3,
		Throw          = 4,
		Count          = 5,
		MAX            = 6
	};

	/**
	 * Enum DeadIsland.EMenuActionAudioFlags
	 */
	enum class EMenuActionAudioFlags : uint8_t
	{
		None             = 0,
		OnInputPressed   = 1,
		OnInputReleased  = 2,
		OnPromptPressed  = 3,
		OnPromptReleased = 4,
		Default          = 5,
		MAX              = 6
	};

	/**
	 * Enum DeadIsland.EMenuActionDataType
	 */
	enum class EMenuActionDataType : uint8_t
	{
		Navigation = 0,
		Operation  = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.EMenuElementObjectLinkageType
	 */
	enum class EMenuElementObjectLinkageType : uint8_t
	{
		None                     = 0,
		ExistingGFxPath          = 1,
		SpawnableClassName       = 2,
		SpawnableLoaderAssetPath = 3,
		SpawnableLoaderImagePath = 4,
		SpawnableEmptyMovieClip  = 5,
		MAX                      = 6
	};

	/**
	 * Enum DeadIsland.EMenuComponentPairedEventTypes
	 */
	enum class EMenuComponentPairedEventTypes : uint8_t
	{
		FocusInOut   = 0,
		HoverOverOut = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadIsland.EMenuComponentSingleEventTypes
	 */
	enum class EMenuComponentSingleEventTypes : uint8_t
	{
		FocusIn   = 0,
		FocusOut  = 1,
		HoverOver = 2,
		HoverOut  = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadIsland.EMenuElementConditionLogicalOperation
	 */
	enum class EMenuElementConditionLogicalOperation : uint8_t
	{
		Or  = 0,
		And = 1,
		MAX = 2
	};

	/**
	 * Enum DeadIsland.EMenuCharacterAction
	 */
	enum class EMenuCharacterAction : uint8_t
	{
		MenuAction   = 0,
		WeaponWheel  = 1,
		LocationMenu = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EMenuSetScreenType
	 */
	enum class EMenuSetScreenType : uint8_t
	{
		EnteringNewScreen     = 0,
		ReturningBackToScreen = 1,
		RefreshingScreen      = 2,
		ClosingScreen         = 3,
		MAX                   = 4
	};

	/**
	 * Enum DeadIsland.EMenuMapHandlerContextualAction
	 */
	enum class EMenuMapHandlerContextualAction : uint8_t
	{
		None       = 0,
		Waypoint   = 1,
		TrackQuest = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EMenuModelViewingType
	 */
	enum class EMenuModelViewingType : uint8_t
	{
		None                   = 0,
		Item                   = 1,
		PlayerCharacter        = 2,
		ZombieCharacter        = 3,
		PlayerCharacterInspect = 4,
		MAX                    = 5
	};

	/**
	 * Enum DeadIsland.EMapBrowserGameType
	 */
	enum class EMapBrowserGameType : uint8_t
	{
		Local    = 0,
		FindGame = 1,
		Host     = 2,
		Private  = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EVideoEndReason
	 */
	enum class EVideoEndReason : uint8_t
	{
		VideoEnd     = 0,
		VideoSkipped = 1,
		MenuClose    = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EUnlockSkillEventsFlow
	 */
	enum class EUnlockSkillEventsFlow : uint8_t
	{
		NoUnlockFlow    = 0,
		Zooming         = 1,
		ShowAllSlots    = 2,
		ShowAllSkills   = 3,
		Revealing       = 4,
		WaitingForInput = 5,
		WaitingToResume = 6,
		NextUnlock      = 7,
		Done            = 8,
		MAX             = 9
	};

	/**
	 * Enum DeadIsland.EWorldMapType
	 */
	enum class EWorldMapType : uint8_t
	{
		LocalDistrictMap = 0,
		LAOverviewMap    = 1,
		Count            = 2,
		MAX              = 3
	};

	/**
	 * Enum DeadIsland.EMinigamePhaseResult
	 */
	enum class EMinigamePhaseResult : uint8_t
	{
		Passed = 0,
		Failed = 1,
		MAX    = 2
	};

	/**
	 * Enum DeadIsland.EProgressionFactType
	 */
	enum class EProgressionFactType : uint8_t
	{
		X   = 0,
		Y   = 1,
		MAX = 2
	};

	/**
	 * Enum DeadIsland.EModifiableValuesMapping
	 */
	enum class EModifiableValuesMapping : uint8_t
	{
		None     = 0,
		VeryLow  = 1,
		Low      = 2,
		Medium   = 3,
		High     = 4,
		VeryHigh = 5,
		Max      = 6
	};

	/**
	 * Enum DeadIsland.EModifierApplicationMethod
	 */
	enum class EModifierApplicationMethod : uint8_t
	{
		Add      = 0,
		Multiply = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EModifierResolutionType
	 */
	enum class EModifierResolutionType : uint8_t
	{
		CumulativeTotal = 0,
		TakeMinimum     = 1,
		TakeMaximum     = 2,
		Multiplicative  = 3,
		Count           = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadIsland.EDuplicateModifierPolicy
	 */
	enum class EDuplicateModifierPolicy : uint8_t
	{
		ProhibitDuplicates = 0,
		AllowDuplicates    = 1,
		RefCountDuplicates = 2,
		Count              = 3,
		MAX                = 4
	};

	/**
	 * Enum DeadIsland.EProjectileModuleExecutionRule
	 */
	enum class EProjectileModuleExecutionRule : uint8_t
	{
		ExecuteOnEveryone                  = 0,
		ExecuteOnServerOnly                = 1,
		ExecuteOnAuthorityOnly             = 2,
		ExecuteOnServerAndReplicatedClient = 3,
		MAX                                = 4
	};

	/**
	 * Enum DeadIsland.EBurstProjectileTargetRule
	 */
	enum class EBurstProjectileTargetRule : uint8_t
	{
		InheritTargetOnPrimaryProjectileOnly = 0,
		InheritTargetOnAllProjectiles        = 1,
		InheritNoTargets                     = 2,
		MAX                                  = 3
	};

	/**
	 * Enum DeadIsland.ERadialDamageBodyPartDistributionMethod
	 */
	enum class ERadialDamageBodyPartDistributionMethod : uint8_t
	{
		None                         = 0,
		ApplyTotalToEachPart         = 1,
		DistributeDividedAcrossParts = 2,
		DistributeToRandomParts      = 3,
		DistributeLowestHealthFirst  = 4,
		MAX                          = 5
	};

	/**
	 * Enum DeadIsland.ENavBarrierState
	 */
	enum class ENavBarrierState : uint8_t
	{
		Navigable = 0,
		Blocked   = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EDescriptionAndIconsActivationPolicy
	 */
	enum class EDescriptionAndIconsActivationPolicy : uint8_t
	{
		Simple             = 0,
		OverrideCompletion = 1,
		FullSpecification  = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.ESimpleObjectiveActivationPolicy
	 */
	enum class ESimpleObjectiveActivationPolicy : uint8_t
	{
		Simple            = 0,
		OverrideStarted   = 1,
		FullSpecification = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadIsland.EOnlineFeature
	 */
	enum class EOnlineFeature : uint8_t
	{
		AccountLinking   = 0,
		OnlineGameplay   = 1,
		OnlinePlay       = 2,
		OnlineService    = 3,
		OnlineHosting    = 4,
		PlatformService  = 5,
		ProsNewsfeed     = 6,
		ProsSignUp       = 7,
		ProsConnectivity = 8,
		Pros             = 9,
		Count            = 10,
		MAX              = 11
	};

	/**
	 * Enum DeadIsland.EOnlineGameActivityOutcome
	 */
	enum class EOnlineGameActivityOutcome : uint8_t
	{
		Completed = 0,
		Failed    = 1,
		Cancelled = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EOnlineGameActivityProgress
	 */
	enum class EOnlineGameActivityProgress : uint8_t
	{
		NotStarted = 0,
		Started    = 1,
		Completed  = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EOnlineGameActivityAvailability
	 */
	enum class EOnlineGameActivityAvailability : uint8_t
	{
		Unavailable = 0,
		Available   = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.ELevelSequenceStartPosition
	 */
	enum class ELevelSequenceStartPosition : uint8_t
	{
		FirstFrame = 0,
		LastFrame  = 1,
		Custom     = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EOpenableMeshTransformRule
	 */
	enum class EOpenableMeshTransformRule : uint8_t
	{
		FullTransform = 0,
		LocationOnly  = 1,
		RotationOnly  = 2,
		ScaleOnly     = 3,
		MAX           = 4
	};

	/**
	 * Enum DeadIsland.EHUDClusterVisibilityOption
	 */
	enum class EHUDClusterVisibilityOption : uint8_t
	{
		Off     = 0,
		Dynamic = 1,
		On      = 2,
		COUNT   = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadIsland.EPairedActionHitReactType
	 */
	enum class EPairedActionHitReactType : uint8_t
	{
		Knockback = 0,
		Death     = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EMissionFilterType
	 */
	enum class EMissionFilterType : uint8_t
	{
		ExplicitMission = 0,
		TypeOfMission   = 1,
		MAX             = 2
	};

	/**
	 * Enum DeadIsland.EInventoryAmountCondition
	 */
	enum class EInventoryAmountCondition : uint8_t
	{
		OccupiedSlots       = 0,
		AvailableSlots      = 1,
		PercentageOccupied  = 2,
		PercentageAvailable = 3,
		MAX                 = 4
	};

	/**
	 * Enum DeadIsland.EGoadGatherResult
	 */
	enum class EGoadGatherResult : uint8_t
	{
		Success         = 0,
		NoCandidates    = 1,
		NothingGoadable = 2,
		NothingInRange  = 3,
		UnknownType     = 4,
		MAX             = 5
	};

	/**
	 * Enum DeadIsland.EObjectiveFilterType
	 */
	enum class EObjectiveFilterType : uint8_t
	{
		AnyObjectives      = 0,
		SpecificObjectives = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.ERarityCheckType
	 */
	enum class ERarityCheckType : uint8_t
	{
		GreaterThanOrEqual = 0,
		Equal              = 1,
		LessThanOrEqual    = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EChallengeFilterType
	 */
	enum class EChallengeFilterType : uint8_t
	{
		ExplicitChallenge = 0,
		TypeOfChallenge   = 1,
		MAX               = 2
	};

	/**
	 * Enum DeadIsland.ECharacterActionPerkConditionOperation
	 */
	enum class ECharacterActionPerkConditionOperation : uint8_t
	{
		Or  = 0,
		And = 1,
		MAX = 2
	};

	/**
	 * Enum DeadIsland.EPerkConditionPlayerInventoryEventsDataSource
	 */
	enum class EPerkConditionPlayerInventoryEventsDataSource : uint8_t
	{
		InventoryComponent                = 0,
		InventoryPersistentDataController = 1,
		MAX                               = 2
	};

	/**
	 * Enum DeadIsland.EPerkNetworkingOverride
	 */
	enum class EPerkNetworkingOverride : uint8_t
	{
		None                   = 0,
		ServerOnlyNoRep        = 1,
		LocalPlayerOnlyNoRep   = 2,
		ServerToAllRep         = 3,
		ServerToAllLocalRep    = 4,
		ServerToAllNonlocalRep = 5,
		Count                  = 6,
		MAX                    = 7
	};

	/**
	 * Enum DeadIsland.EEffectTriggerPolicy
	 */
	enum class EEffectTriggerPolicy : uint8_t
	{
		RequireAllConditionsSatisfied = 0,
		RequireAnyConditionSatisfied  = 1,
		Count                         = 2,
		MAX                           = 3
	};

	/**
	 * Enum DeadIsland.EConditionTriggerWindow
	 */
	enum class EConditionTriggerWindow : uint8_t
	{
		DisabledWhilstEffectsActive             = 0,
		CanRetriggerWhilstPreviousEffectsActive = 1,
		Count                                   = 2,
		MAX                                     = 3
	};

	/**
	 * Enum DeadIsland.EDuplicatePerkPolicy
	 */
	enum class EDuplicatePerkPolicy : uint8_t
	{
		AllowDuplicateInstances = 0,
		RefCountExisting        = 1,
		Count                   = 2,
		MAX                     = 3
	};

	/**
	 * Enum DeadIsland.EPerkEffectModifyFuryOperation
	 */
	enum class EPerkEffectModifyFuryOperation : uint8_t
	{
		IncreaseFuryBy = 0,
		DecreaseFuryBy = 1,
		SetFuryTo      = 2,
		MAX            = 3
	};

	/**
	 * Enum DeadIsland.EPerkEffectExecutionRule
	 */
	enum class EPerkEffectExecutionRule : uint8_t
	{
		ExecuteOnEveryone             = 0,
		ExecuteOnServerOnly           = 1,
		ExecuteOnLocalPlayerOnly      = 2,
		ExecuteOnAllExceptLocalPlayer = 3,
		Count                         = 4,
		MAX                           = 5
	};

	/**
	 * Enum DeadIsland.EPerkInstanceState
	 */
	enum class EPerkInstanceState : uint8_t
	{
		Invalid     = 0,
		Active      = 1,
		CoolingDown = 2,
		Exhausted   = 3,
		Count       = 4,
		MAX         = 5
	};

	/**
	 * Enum DeadIsland.EConditionExecutionPolicy
	 */
	enum class EConditionExecutionPolicy : uint8_t
	{
		ServerOnly = 0,
		Everyone   = 1,
		Count      = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EConditionUsagePolicy
	 */
	enum class EConditionUsagePolicy : uint8_t
	{
		EffectActivation   = 0,
		EffectDeactivation = 1,
		MAX                = 2
	};

	/**
	 * Enum DeadIsland.EConditionSatisfiedAutoReset
	 */
	enum class EConditionSatisfiedAutoReset : uint8_t
	{
		Never                   = 0,
		SingleFrame             = 1,
		TimeSinceFirstSatisfied = 2,
		TimeSinceLastSatsified  = 3,
		MAX                     = 4
	};

	/**
	 * Enum DeadIsland.EPerkItemUpgradeRecipient
	 */
	enum class EPerkItemUpgradeRecipient : uint8_t
	{
		WeaponOwner = 0,
		Weapon      = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.EPhysicalizationFullBodyLOD
	 */
	enum class EPhysicalizationFullBodyLOD : uint8_t
	{
		AlwaysEnabled  = 0,
		KeepIfEnabled  = 1,
		Default        = 2,
		ReadyToDisable = 3,
		Disabled       = 4,
		MAX            = 5
	};

	/**
	 * Enum DeadIsland.EPickupabilityRule
	 */
	enum class EPickupabilityRule : uint8_t
	{
		Everyone  = 0,
		OwnerOnly = 1,
		Nobody    = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EPickupVisibilityRule
	 */
	enum class EPickupVisibilityRule : uint8_t
	{
		Everyone           = 0,
		Pickupable         = 1,
		VisiblePreInteract = 2,
		MAX                = 3
	};

	/**
	 * Enum DeadIsland.EPickupabilityState
	 */
	enum class EPickupabilityState : uint8_t
	{
		Pickupable    = 0,
		NotPickupable = 1,
		None          = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.EPickupVisibility
	 */
	enum class EPickupVisibility : uint8_t
	{
		Visible    = 0,
		NotVisible = 1,
		None       = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EPlayerGathererState
	 */
	enum class EPlayerGathererState : uint8_t
	{
		NotGathering = 0,
		Gathering    = 1,
		MAX          = 2
	};

	/**
	 * Enum DeadIsland.EMeshPerspective
	 */
	enum class EMeshPerspective : uint8_t
	{
		FirstPersonMesh = 0,
		ThirdPersonMesh = 1,
		Count           = 2,
		MAX             = 3
	};

	/**
	 * Enum DeadIsland.ELedgeGrabType
	 */
	enum class ELedgeGrabType : uint8_t
	{
		Climb        = 0,
		ClimbAndDrop = 1,
		Mantle       = 2,
		Vault        = 3,
		Custom       = 4,
		None         = 5,
		MAX          = 6
	};

	/**
	 * Enum DeadIsland.EPlayerActionState
	 */
	enum class EPlayerActionState : uint8_t
	{
		None     = 0,
		Reaching = 1,
		Success  = 2,
		Fail     = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EPlayerAction
	 */
	enum class EPlayerAction : uint8_t
	{
		Grabbing = 0,
		Slide    = 1,
		None     = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EForceParsePlayerLocomotionAnimStatesH
	 */
	enum class EForceParsePlayerLocomotionAnimStatesH : uint8_t
	{
		Nope = 0,
		MAX  = 1
	};

	/**
	 * Enum DeadIsland.EPlayerLocomotionState
	 */
	enum class EPlayerLocomotionState : uint8_t
	{
		Idle  = 0,
		Move  = 1,
		Slide = 2,
		InAir = 3,
		MAX   = 4
	};

	/**
	 * Enum DeadIsland.EPopupAnimationDamageCriteriaEffectiveness
	 */
	enum class EPopupAnimationDamageCriteriaEffectiveness : uint8_t
	{
		DontCare             = 0,
		MustFallBetweenRange = 1,
		MustFallOutsideRange = 2,
		MAX                  = 3
	};

	/**
	 * Enum DeadIsland.EPopupAnimationDamageCriteriaLimbChoice
	 */
	enum class EPopupAnimationDamageCriteriaLimbChoice : uint8_t
	{
		NoDamage                  = 0,
		MustBeBroken              = 1,
		MustBeDismembered         = 2,
		MustBeBrokenOrDismembered = 3,
		DontCare                  = 4,
		MAX                       = 5
	};

	/**
	 * Enum DeadIsland.EPopupAnimationDamageCriteriaChoice
	 */
	enum class EPopupAnimationDamageCriteriaChoice : uint8_t
	{
		MustBeFalse = 0,
		MustBeTrue  = 1,
		DontCare    = 2,
		MAX         = 3
	};

	/**
	 * Enum DeadIsland.EPredictiveImpactNetOwner
	 */
	enum class EPredictiveImpactNetOwner : uint8_t
	{
		None       = 0,
		Victim     = 1,
		Instigator = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EPrepareWorldCoordinatorTier
	 */
	enum class EPrepareWorldCoordinatorTier : uint8_t
	{
		Tier1 = 0,
		Tier2 = 1,
		Tier3 = 2,
		Tier4 = 3,
		Tier5 = 4,
		MAX   = 5
	};

	/**
	 * Enum DeadIsland.EValueSpecificationMethod
	 */
	enum class EValueSpecificationMethod : uint8_t
	{
		Fixed  = 0,
		Auto   = 1,
		Offset = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum DeadIsland.EModifierApplicationRule
	 */
	enum class EModifierApplicationRule : uint8_t
	{
		MultiplyBaseValue = 0,
		SumWithBaseValue  = 1,
		Count             = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadIsland.EModifierConfigType
	 */
	enum class EModifierConfigType : uint8_t
	{
		Modifier = 0,
		Perk     = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EProjectileSpawnerBlockReasonType
	 */
	enum class EProjectileSpawnerBlockReasonType : uint8_t
	{
		CosmeticEffectBlockReason     = 0,
		ProjectileSpawningBlockReason = 1,
		MAX                           = 2
	};

	/**
	 * Enum DeadIsland.ETargetPointRaycastType
	 */
	enum class ETargetPointRaycastType : uint8_t
	{
		RaycastLocalCameraFallbackToMuzzle = 0,
		RaycastFromMuzzle                  = 1,
		MAX                                = 2
	};

	/**
	 * Enum DeadIsland.EAuthorityType
	 */
	enum class EAuthorityType : uint8_t
	{
		PredictiveClient = 0,
		Authority        = 1,
		MAX              = 2
	};

	/**
	 * Enum DeadIsland.EDealAttemptResult
	 */
	enum class EDealAttemptResult : uint8_t
	{
		Success = 0,
		Fail    = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EQuestUIProgressType
	 */
	enum class EQuestUIProgressType : uint8_t
	{
		None          = 0,
		Count         = 1,
		XOfY          = 2,
		Percent       = 3,
		TimeIncrement = 4,
		TimeDecrement = 5,
		Max           = 6
	};

	/**
	 * Enum DeadIsland.EProximityDetonatedProjectileState
	 */
	enum class EProximityDetonatedProjectileState : uint8_t
	{
		None      = 0,
		Inactive  = 1,
		Armed     = 2,
		Triggered = 3,
		Detonated = 4,
		MAX       = 5
	};

	/**
	 * Enum DeadIsland.ERandomNumberGeneratorDistribution
	 */
	enum class ERandomNumberGeneratorDistribution : uint8_t
	{
		AbsoluteValue = 0,
		Uniform       = 1,
		Normal        = 2,
		Cauchy        = 3,
		Count         = 4,
		MAX           = 5
	};

	/**
	 * Enum DeadIsland.ERangeBehaviour
	 */
	enum class ERangeBehaviour : uint8_t
	{
		UntilRange = 0,
		AfterRange = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.ERecoilHandlerState
	 */
	enum class ERecoilHandlerState : uint8_t
	{
		Inactive  = 0,
		Recoiling = 1,
		Decaying  = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EDonutRespawnPickerPriorityScheme
	 */
	enum class EDonutRespawnPickerPriorityScheme : uint8_t
	{
		Donut_Far_Near = 0,
		Donut_Near_Far = 1,
		Donut_MAX      = 2
	};

	/**
	 * Enum DeadIsland.EDistributionType
	 */
	enum class EDistributionType : uint8_t
	{
		FullWeights   = 0,
		EqualWeights  = 1,
		ScoredWeights = 2,
		MAX           = 3
	};

	/**
	 * Enum DeadIsland.ESaveGameType
	 */
	enum class ESaveGameType : uint8_t
	{
		Major    = 0,
		Minor    = 1,
		Critical = 2,
		Count    = 3,
		MAX      = 4
	};

	/**
	 * Enum DeadIsland.EScopedEffectKnowledgeBaseChangeType
	 */
	enum class EScopedEffectKnowledgeBaseChangeType : uint8_t
	{
		Add       = 0,
		Increment = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EItemCountMethod
	 */
	enum class EItemCountMethod : uint8_t
	{
		StackOnly  = 0,
		Procedural = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.ESkillEffectExecutionRule
	 */
	enum class ESkillEffectExecutionRule : uint8_t
	{
		AllowLocalExecution    = 0,
		ExecuteOnAuthorityOnly = 1,
		MAX                    = 2
	};

	/**
	 * Enum DeadIsland.ESkillSlotTransactionType
	 */
	enum class ESkillSlotTransactionType : uint8_t
	{
		SkillAssignedManual  = 0,
		SkillAssignedDefault = 1,
		SkillAssignedRandom  = 2,
		SkillAssignedState   = 3,
		Count                = 4,
		MAX                  = 5
	};

	/**
	 * Enum DeadIsland.ESkillTreeLineConnectionType
	 */
	enum class ESkillTreeLineConnectionType : uint8_t
	{
		None    = 0,
		BeeLine = 1,
		ZigZag  = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.ESkillTreeTierRequirementMode
	 */
	enum class ESkillTreeTierRequirementMode : uint8_t
	{
		MustMeetAtLeastOneRequirement = 0,
		MustMeetAllRequirements       = 1,
		MAX                           = 2
	};

	/**
	 * Enum DeadIsland.ESkillEventType
	 */
	enum class ESkillEventType : uint8_t
	{
		Invalid        = 0,
		SlotUnlock     = 1,
		SkillUnlock    = 2,
		CategoryUnlock = 3,
		MAX            = 4
	};

	/**
	 * Enum DeadIsland.EStaminaCostModifier
	 */
	enum class EStaminaCostModifier : uint8_t
	{
		None     = 0,
		Movement = 1,
		Combat   = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EStandUpOrientation
	 */
	enum class EStandUpOrientation : uint8_t
	{
		FaceDown    = 0,
		FaceUp      = 1,
		OnLeftSide  = 2,
		OnRightSide = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadIsland.ELookAtType
	 */
	enum class ELookAtType : uint8_t
	{
		None        = 0,
		UpperBody   = 1,
		HeadAndEyes = 2,
		EyesOnly    = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadIsland.EStatefulActivityExitState
	 */
	enum class EStatefulActivityExitState : uint8_t
	{
		DefaultState  = 0,
		PreviousState = 1,
		NextState     = 2,
		NamedState    = 3,
		ActivityOutOf = 4,
		ExitActivity  = 5,
		MAX           = 6
	};

	/**
	 * Enum DeadIsland.EStatefulActivityContinuousLoopTimeoutMode
	 */
	enum class EStatefulActivityContinuousLoopTimeoutMode : uint8_t
	{
		NoTimeout                        = 0,
		FixedTimeoutDuration             = 1,
		RandomTimeoutDurationWithinRange = 2,
		MAX                              = 3
	};

	/**
	 * Enum DeadIsland.EStatefulActivityLoopMode
	 */
	enum class EStatefulActivityLoopMode : uint8_t
	{
		NoLoop                = 0,
		ContinuousLoop        = 1,
		FixedLoopCount        = 2,
		RandomWithinRangeLoop = 3,
		HoldFirstFrame        = 4,
		MAX                   = 5
	};

	/**
	 * Enum DeadIsland.EStateChangeTypes
	 */
	enum class EStateChangeTypes : uint8_t
	{
		Immediate = 0,
		LoopEnd   = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EAreaOfEffectAutoResizePolicy
	 */
	enum class EAreaOfEffectAutoResizePolicy : uint8_t
	{
		NoAutoResize                     = 0,
		AutoResizeToOwnerCollisionRadius = 1,
		AutoResizeToTransmitRadius       = 2,
		MAX                              = 3
	};

	/**
	 * Enum DeadIsland.EStatGathererUpdateResponsibility
	 */
	enum class EStatGathererUpdateResponsibility : uint8_t
	{
		Authority = 0,
		Local     = 1,
		MAX       = 2
	};

	/**
	 * Enum DeadIsland.EStatusEffectUIIconProgressState
	 */
	enum class EStatusEffectUIIconProgressState : uint8_t
	{
		Accumulating = 0,
		Draining     = 1,
		Idle         = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EStickyReticleMagnetismMode
	 */
	enum class EStickyReticleMagnetismMode : uint8_t
	{
		Off          = 0,
		Full         = 1,
		RotationOnly = 2,
		MAX          = 3
	};

	/**
	 * Enum DeadIsland.EStimTestStateResult
	 */
	enum class EStimTestStateResult : uint8_t
	{
		Processing = 0,
		Succeeded  = 1,
		Failed     = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EStimTestResult
	 */
	enum class EStimTestResult : uint8_t
	{
		Uninitialised = 0,
		Processing    = 1,
		Sleeping      = 2,
		NotRequired   = 3,
		Succeeded     = 4,
		Failed        = 5,
		MAX           = 6
	};

	/**
	 * Enum DeadIsland.EStrafeDirection
	 */
	enum class EStrafeDirection : uint8_t
	{
		Left  = 0,
		Right = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadIsland.ETalentUsageType
	 */
	enum class ETalentUsageType : uint8_t
	{
		Active  = 0,
		Passive = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EOffsetSpace
	 */
	enum class EOffsetSpace : uint8_t
	{
		Local = 0,
		World = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadIsland.ETargetPointInfoType
	 */
	enum class ETargetPointInfoType : uint8_t
	{
		Actor     = 0,
		Component = 1,
		Bone      = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EGFxIconSubstitutitonTextfieldFlags
	 */
	enum class EGFxIconSubstitutitonTextfieldFlags : uint8_t
	{
		None                   = 0,
		ShowActionIconsAsHolds = 1,
		MAX                    = 2
	};

	/**
	 * Enum DeadIsland.ETextSubstitutionVerticalAlignment
	 */
	enum class ETextSubstitutionVerticalAlignment : uint8_t
	{
		Top    = 0,
		Middle = 1,
		Bottom = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.ETextSubstitutionHorizontalAlignment
	 */
	enum class ETextSubstitutionHorizontalAlignment : uint8_t
	{
		Left   = 0,
		Middle = 1,
		Right  = 2,
		MAX    = 3
	};

	/**
	 * Enum DeadIsland.EResourceType
	 */
	enum class EResourceType : uint8_t
	{
		Ammo          = 0,
		CooldownTimer = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadIsland.ECooldownState
	 */
	enum class ECooldownState : uint8_t
	{
		Ready       = 0,
		CoolingDown = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.EDisarmInteractSettings
	 */
	enum class EDisarmInteractSettings : uint8_t
	{
		E_First  = 0,
		E_Second = 1,
		E_Both   = 2,
		E_MAX    = 3
	};

	/**
	 * Enum DeadIsland.ETraversalGenerationFailureStage
	 */
	enum class ETraversalGenerationFailureStage : uint8_t
	{
		Uninitialised      = 0,
		FindStartPoint     = 1,
		FindStartEdge      = 2,
		FindEndPoint       = 3,
		FindGap            = 4,
		OutsideMetrics     = 5,
		NoMatchingCategory = 6,
		MAX                = 7
	};

	/**
	 * Enum DeadIsland.ETutorialNetOwner
	 */
	enum class ETutorialNetOwner : uint8_t
	{
		LocalPlayer = 0,
		Host        = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.ETutorialType
	 */
	enum class ETutorialType : uint8_t
	{
		HUD             = 0,
		Menu            = 1,
		ViewedFromStart = 2,
		None            = 3,
		MAX             = 4
	};

	/**
	 * Enum DeadIsland.EMenuTutorialLocation
	 */
	enum class EMenuTutorialLocation : uint8_t
	{
		Right = 0,
		Left  = 1,
		MAX   = 2
	};

	/**
	 * Enum DeadIsland.EUIStateDataBlockingIcon
	 */
	enum class EUIStateDataBlockingIcon : uint8_t
	{
		Unavailable = 0,
		Locked      = 1,
		MAX         = 2
	};

	/**
	 * Enum DeadIsland.EUIStateDataType
	 */
	enum class EUIStateDataType : uint8_t
	{
		None             = 0,
		BasicInteract    = 1,
		BlockingInteract = 2,
		MAX              = 3
	};

	/**
	 * Enum DeadIsland.EEquipmentSlotsWheelType
	 */
	enum class EEquipmentSlotsWheelType : uint8_t
	{
		NONE    = 0,
		Weapons = 1,
		Emotes  = 2,
		Count   = 3,
		MAX     = 4
	};

	/**
	 * Enum DeadIsland.EIconFormat
	 */
	enum class EIconFormat : uint8_t
	{
		Texture = 0,
		Vector  = 1,
		MAX     = 2
	};

	/**
	 * Enum DeadIsland.EUnlockableType
	 */
	enum class EUnlockableType : uint8_t
	{
		Invalid = 0,
		Trap    = 1,
		Weapon  = 2,
		Value   = 3,
		Level   = 4,
		Item    = 5,
		Perk    = 6,
		Count   = 7,
		MAX     = 8
	};

	/**
	 * Enum DeadIsland.EUnlockRequirementsFilter
	 */
	enum class EUnlockRequirementsFilter : uint8_t
	{
		None               = 0,
		RequirementsMet    = 1,
		RequirementsNotMet = 2,
		All                = 3,
		MAX                = 4
	};

	/**
	 * Enum DeadIsland.EValueSource
	 */
	enum class EValueSource : uint8_t
	{
		Raw        = 0,
		Blackboard = 1,
		DataAsset  = 2,
		MAX        = 3
	};

	/**
	 * Enum DeadIsland.EVendorGenerationPolicy
	 */
	enum class EVendorGenerationPolicy : uint8_t
	{
		NONE        = 0,
		OnBeginPlay = 1,
		OnInteract  = 2,
		Custom      = 3,
		MAX         = 4
	};

	/**
	 * Enum DeadIsland.EViewTargetSelection
	 */
	enum class EViewTargetSelection : uint8_t
	{
		Camera        = 0,
		PlayerCapsule = 1,
		MAX           = 2
	};

	/**
	 * Enum DeadIsland.EViewTargetDiffOutcome
	 */
	enum class EViewTargetDiffOutcome : uint8_t
	{
		Blend             = 0,
		SkipBlend         = 1,
		UnregisterRequest = 2,
		MAX               = 3
	};

	/**
	 * Enum DeadIsland.EViewTargetValueSource
	 */
	enum class EViewTargetValueSource : uint8_t
	{
		FromTargetPointInfo = 0,
		FromExplicitValue   = 1,
		Count               = 2,
		MAX                 = 3
	};

	/**
	 * Enum DeadIsland.EVoiceChatType
	 */
	enum class EVoiceChatType : uint8_t
	{
		Disabled   = 0,
		PushToTalk = 1,
		Toggle     = 2,
		Talk       = 3,
		MAX        = 4
	};

	/**
	 * Enum DeadIsland.EVoiceCommandState
	 */
	enum class EVoiceCommandState : uint8_t
	{
		None                       = 0,
		InitVoiceSystem            = 1,
		PendingInitResult          = 2,
		PendingUserAuthentication  = 3,
		CheckForAuthentication     = 4,
		PendingVoiceAuthentication = 5,
		BeginConnection            = 6,
		VoiceInitializationFailure = 7,
		WaitForAuthenticationCode  = 8,
		WaitingForConnection       = 9,
		AuthenticationFailed       = 10,
		ConnectionFailed           = 11,
		ConnectionFailedAccept     = 12,
		ReadyForVoiceCommands      = 13,
		MAX                        = 14
	};

	/**
	 * Enum DeadIsland.EVoiceComponentStatus
	 */
	enum class EVoiceComponentStatus : uint8_t
	{
		None                  = 0,
		VoiceCommandsDisabled = 1,
		NoOnlineConnection    = 2,
		NoAudioInputDevice    = 3,
		NotAuthenticated      = 4,
		NotConnected          = 5,
		AccountIneligible     = 6,
		ReadyForVoiceCommands = 7,
		MAX                   = 8
	};

	/**
	 * Enum DeadIsland.EVoiceComponentString
	 */
	enum class EVoiceComponentString : uint8_t
	{
		None                  = 0,
		InitializationFailed  = 1,
		AuthenticationPending = 2,
		AuthenticationFailed  = 3,
		ConnectionFailed      = 4,
		NoAudioDevice         = 5,
		ValidationCode        = 6,
		ValidationCodeQR      = 7,
		GameIneligible        = 8,
		AccountIneligible     = 9,
		LocationIneligible    = 10,
		LocaleIneligible      = 11,
		UnknownIneligible     = 12,
		MAX                   = 13
	};

	/**
	 * Enum DeadIsland.EWeaponTypeFilter
	 */
	enum class EWeaponTypeFilter : uint8_t
	{
		BareHands = 0,
		Melee     = 1,
		FireArms  = 2,
		MAX       = 3
	};

	/**
	 * Enum DeadIsland.EWeaponChangeType
	 */
	enum class EWeaponChangeType : uint8_t
	{
		Power      = 0,
		Profile    = 1,
		Damage     = 2,
		WeaponType = 3,
		Next       = 4,
		Previous   = 5,
		MAX        = 6
	};

	/**
	 * Enum DeadIsland.EGoadQueryFilter
	 */
	enum class EGoadQueryFilter : uint8_t
	{
		None      = 0,
		Nearest   = 1,
		Strongest = 2,
		Weakest   = 3,
		MAX       = 4
	};

	/**
	 * Enum DeadIsland.EWaypointableQueryFilter
	 */
	enum class EWaypointableQueryFilter : uint8_t
	{
		Nearest  = 0,
		Furthest = 1,
		MAX      = 2
	};

	/**
	 * Enum DeadIsland.EWaypointableQueryType
	 */
	enum class EWaypointableQueryType : uint8_t
	{
		PointOfInterest       = 0,
		Workbench             = 1,
		UsedFusebox           = 2,
		UnusedFusebox         = 3,
		FastTravelPoint       = 4,
		FastTravelBoard       = 5,
		ZombieLootbox         = 6,
		ClosedZombieLootbox   = 7,
		TreasureLootbox       = 8,
		ClosedTreasureLootbox = 9,
		Vendor                = 10,
		Safehouse             = 11,
		MAX                   = 12
	};

	/**
	 * Enum DeadIsland.EWeaponProfile
	 */
	enum class EWeaponProfile : uint8_t
	{
		Default      = 0,
		Breach       = 1,
		Rupture      = 2,
		CrowdControl = 3,
		Flurry       = 4,
		Harvester    = 5,
		Precision    = 6,
		Rapid        = 7,
		Sharpshooter = 8,
		Tactical     = 9,
		MAX          = 10
	};

	/**
	 * Enum DeadIsland.EWeaponHand
	 */
	enum class EWeaponHand : uint8_t
	{
		Mainhand = 0,
		Offhand  = 1,
		Num      = 2,
		MAX      = 3
	};

	/**
	 * Enum DeadIsland.EMeleeWeaponDurabilityThresholdType
	 */
	enum class EMeleeWeaponDurabilityThresholdType : uint8_t
	{
		Percentage = 0,
		Absolute   = 1,
		MAX        = 2
	};

	/**
	 * Enum DeadIsland.EMeleeItemCondition
	 */
	enum class EMeleeItemCondition : uint8_t
	{
		Fine    = 0,
		Damaged = 1,
		Broken  = 2,
		MAX     = 3
	};

	/**
	 * Enum DeadIsland.EWeaponActorSource
	 */
	enum class EWeaponActorSource : uint8_t
	{
		WeaponOwner          = 0,
		WeaponProxyComponent = 1,
		MAX                  = 2
	};

	/**
	 * Enum DeadIsland.EImpactType
	 */
	enum class EImpactType : uint8_t
	{
		Blunt  = 0,
		Sharp  = 1,
		Ranged = 2,
		Other  = 3,
		MAX    = 4
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct DeadIsland.AccumulatingEffectRepItem
	 * Size -> 0x0014 (FullSize[0x0020] - InheritedSize[0x000C])
	 */
	struct FAccumulatingEffectRepItem : public FFastArraySerializerItem
	{
	public:
		int32_t                                                    ReplicatedInstanceIndex;                                 // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAccumulatingEffectState                                   EffectState;                                             // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HSNA[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LastUpdatedValue;                                        // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastUpdatedTimeStamp;                                    // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LastUpdatedDecayRate;                                    // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AccumulatingEffectRepData
	 * Size -> 0x0018 (FullSize[0x0120] - InheritedSize[0x0108])
	 */
	struct FAccumulatingEffectRepData : public FFastArraySerializer
	{
	public:
		TArray<struct FAccumulatingEffectRepItem>                  Items;                                                   // 0x0108(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class UAccumulatingEffectComponent*                        Owner;                                                   // 0x0118(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AccumulatingEffectSettings
	 * Size -> 0x0058
	 */
	struct FAccumulatingEffectSettings
	{
	public:
		float                                                      AccumulatingDecayRatePerSecond;                          // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultEffectDuration;                                   // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AccumulatingPauseDuration;                               // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PauseDuration;                                           // 0x000C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAccumulatingEffectImplementation*                   EffectImplementation;                                    // 0x0010(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UModifiableValueDefinition*                          GainModifier;                                            // 0x0018(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UModifiableValueDefinition*                          DecayModifier;                                           // 0x0020(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UModifiableValueDefinition*                          EffectDurationModifier;                                  // 0x0028(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCosmeticEffectsDefinition*                          LocalComseticEffect;                                     // 0x0030(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUIElementalData*                                    UIElementalData;                                         // 0x0038(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                UIDisplayName;                                           // 0x0040(0x0018) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ActionAliasBindingList
	 * Size -> 0x0010
	 */
	struct FActionAliasBindingList
	{
	public:
		TArray<class UActionAliasBinding*>                         PriorityOrderedActionBindings;                           // 0x0000(0x0010) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ActionAliasBindingRecord
	 * Size -> 0x0018
	 */
	struct FActionAliasBindingRecord
	{
	public:
		unsigned char                                              UnknownData_FY40[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UActionAliasBinding*                                 ActionAliasBinding;                                      // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ActionAliasBindingStack
	 * Size -> 0x0010
	 */
	struct FActionAliasBindingStack
	{
	public:
		TArray<struct FActionAliasBindingRecord>                   RegisteredActionAliasBindingRecords;                     // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ActionRequesterRequestData
	 * Size -> 0x0020
	 */
	struct FActionRequesterRequestData
	{
	public:
		class UActionDefinition*                                   ActionToRequest;                                         // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCustomActionParamsBase*                             ParamsForActionToRequest;                                // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCharacterActionRequestHelper*                       RequestHelper;                                           // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bControlRequestedActionsLifetime;                        // 0x0018(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_73PA[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.ActionRequesterRequestRuntimeInfo
	 * Size -> 0x0010
	 */
	struct FActionRequesterRequestRuntimeInfo
	{
	public:
		class UCharacterActionRequestHelper*                       RequestHelper;                                           // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QUFO[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.ActionSequencerRequestData
	 * Size -> 0x0090
	 */
	struct FActionSequencerRequestData
	{
	public:
		class FName                                                Name;                                                    // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UActionDefinition*                                   ActionToRequest;                                         // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              ParamsClassPtrForActionToRequest;                        // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftClassPath                                      ParamsClassForActionToRequest;                           // 0x0018(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCustomActionParamsBase*                             ParamsForActionToRequest;                                // 0x0030(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              AdvanceOnCustomSignals[0x50];                            // 0x0038(0x0050) UNKNOWN PROPERTY: SetProperty
		EActionSequencerSubActionEarlyFinishResponse               RequestFailResponse;                                     // 0x0088(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EActionSequencerSubActionEarlyFinishResponse               InterruptedResponse;                                     // 0x0089(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FRUY[0x6];                                   // 0x008A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.ActionSequencerRequestRuntimeInfo
	 * Size -> 0x0018
	 */
	struct FActionSequencerRequestRuntimeInfo
	{
	public:
		class UCharacterActionRequestHelper*                       RequestHelper;                                           // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P4BW[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.TargetPointInfo
	 * Size -> 0x0050
	 */
	struct FTargetPointInfo
	{
	public:
		TWeakObjectPtr<class USceneComponent>                      SceneComponent;                                          // 0x0000(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TWeakObjectPtr<class AActor>                               Actor;                                                   // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                BoneName;                                                // 0x0010(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                SocketName;                                              // 0x0018(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             VectorLocation;                                          // 0x0020(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bVectorValid;                                            // 0x002C(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bRotatorValid;                                           // 0x002D(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bUserProvidedMeshValid;                                  // 0x002E(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_P15U[0x1];                                   // 0x002F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                            RotatorRotation;                                         // 0x0030(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate
		struct FVector                                             AdditionalLocalSpaceOffset;                              // 0x003C(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TWeakObjectPtr<class UMeshComponent>                       CachedMeshComponent;                                     // 0x0048(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.ActiveCombatRepositioningSettings
	 * Size -> 0x001C
	 */
	struct FActiveCombatRepositioningSettings
	{
	public:
		float                                                      MaxRepositioningDistance;                                // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Timeout;                                                 // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Tolerance;                                               // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetCollisionTolerance;                                // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TravelSpeed;                                             // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaximumRelativeVerticalOffsetTargetIsConsideredValid;    // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseActorLocation;                                       // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseRootMotionSource;                                    // 0x0019(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PFEY[0x2];                                   // 0x001A(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.CosmeticEffectWrapper
	 * Size -> 0x0018
	 */
	struct FCosmeticEffectWrapper
	{
	public:
		bool                                                       bSpecifyDirectly;                                        // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J76W[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCosmeticEffectsDefinition*                          CosmeticEffectDefinition;                                // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CosmeticEffectObjectSetName;                             // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.StimChooser
	 * Size -> 0x0010
	 */
	struct FStimChooser
	{
	public:
		class UStimTemplate*                                       StimTemplate;                                            // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                RowName;                                                 // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.ProjectileConfiguration
	 * Size -> 0x0030
	 */
	struct FProjectileConfiguration
	{
	public:
		class UClass*                                              ProjectileType;                                          // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EProjectileCreationParameterSource                         ParameterSource;                                         // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A3NY[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UProjectileCreationParams*                           CreationParams;                                          // 0x0010(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UProjectileCreationParameterGenerator*               CreationParamGenerator;                                  // 0x0018(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCustomProjectileSpawnMethod*                        ProjectileSpawnMethod;                                   // 0x0020(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UProjectileTrajectoryAdjustmentHelper*               TrajectoryAdjustmentHelper;                              // 0x0028(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AngleRangeClampSettings
	 * Size -> 0x0014
	 */
	struct FAngleRangeClampSettings
	{
	public:
		bool                                                       bEnforceMaxPositivePitchAdjustMagnitude;                 // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZIQ0[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxPositivePitchAdjustMagnitudeInDegrees;                // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReturnClampedPositiveIfExceeds;                         // 0x0008(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnforceMaxNegativePitchAdjustMagnitude;                 // 0x0009(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HHVI[0x2];                                   // 0x000A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxNegativePitchAdjustMagnitudeInDegrees;                // 0x000C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReturnClampedNegativeIfExceeds;                         // 0x0010(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SPQW[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AttributeLevelScalingSettings
	 * Size -> 0x0050
	 */
	struct FAttributeLevelScalingSettings
	{
	public:
		ELevelScalingMethod                                        LevelScalingMethod;                                      // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NO05[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRangeBasedScalar                                   Range;                                                   // 0x0008(0x0028) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		float                                                      LinearPerLevelGrowthAsFractionOfBase;                    // 0x0030(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      IncrementPerLevel;                                       // 0x0034(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         LevelScalingCurve;                                       // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAttributeValuePerLevelMap*                          ExplicitAttributeLevelValues;                            // 0x0040(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ExplicitAttributeName;                                   // 0x0048(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttributeEffect
	 * Size -> 0x0020
	 */
	struct FAttributeEffect
	{
	public:
		class UModifiableValueDefinition*                          ModifierType;                                            // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bModifierValueShouldMatchAttributeValue;                 // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MLUP[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AttributeQuantityToApplyZeroModifier;                    // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RequiredAttributeIncrement;                              // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ModifierAppliedPerIncrement;                             // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowModifierForPartialIncrements;                      // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G4N1[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AttributeState
	 * Size -> 0x0018
	 */
	struct FAttributeState
	{
	public:
		float                                                      RawValue;                                                // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RawValueLevelScaled;                                     // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RawValueLevelScaledAndModified;                          // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RawValueLevelScaledModifiedAndRounded;                   // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RawValueLevelScaledModifiedAndRoundedClamped;            // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EffectiveLevel;                                          // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttributeInitialSettings
	 * Size -> 0x0068
	 */
	struct FAttributeInitialSettings
	{
	public:
		bool                                                       bUseTypeDefaultValue;                                    // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDefaultValueOverrideType                                  OverrideType;                                            // 0x0001(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AMKN[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DesiredValue;                                            // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinValue;                                                // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxValue;                                                // 0x000C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseDefaultLevelScalingSettings;                         // 0x0010(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QPEW[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAttributeLevelScalingSettings                      DesiredLevelScalingSettings;                             // 0x0018(0x0050) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttributeTypeAndValue
	 * Size -> 0x0070
	 */
	struct FAttributeTypeAndValue
	{
	public:
		class UAttributeType*                                      Type;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttributeInstanceRepItem
	 * Size -> 0x002C (FullSize[0x0038] - InheritedSize[0x000C])
	 */
	struct FAttributeInstanceRepItem : public FFastArraySerializerItem
	{
	public:
		struct FAttributeState                                     InstanceState;                                           // 0x000C(0x0018) NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7M7K[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAttributeInstance*                                  ReplicatedInstance;                                      // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              Index;                                                   // 0x0030(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S3C3[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AttributeInstanceRepData
	 * Size -> 0x0018 (FullSize[0x0120] - InheritedSize[0x0108])
	 */
	struct FAttributeInstanceRepData : public FFastArraySerializer
	{
	public:
		TArray<struct FAttributeInstanceRepItem>                   Items;                                                   // 0x0108(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class UAttributesComponent*                                Owner;                                                   // 0x0118(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.MaxHealthAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FMaxHealthAttributeTypeAndInitialSettings
	{
	public:
		class UMaxHealthAttributeType*                             AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.BaseDamageAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FBaseDamageAttributeTypeAndInitialSettings
	{
	public:
		class UAIBaseDamageAttributeType*                          AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.BaseForceAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FBaseForceAttributeTypeAndInitialSettings
	{
	public:
		class UAIBaseForceAttributeType*                           AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.BaseStabilityAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FBaseStabilityAttributeTypeAndInitialSettings
	{
	public:
		class UAIBaseStabilityAttributeType*                       AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.XPRewardAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FXPRewardAttributeTypeAndInitialSettings
	{
	public:
		class UXPRewardAttributeType*                              AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.FuryRewardAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FFuryRewardAttributeTypeAndInitialSettings
	{
	public:
		class UFuryRewardAttributeType*                            AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AICharacterLevelInfo
	 * Size -> 0x0004
	 */
	struct FAICharacterLevelInfo
	{
	public:
		int32_t                                                    OnKilledXP;                                              // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.RandomNumberGenerator_Float
	 * Size -> 0x0028
	 */
	struct FRandomNumberGenerator_Float
	{
	public:
		ERandomNumberGeneratorDistribution                         Distribution;                                            // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RR7T[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ExpectedValue;                                           // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StandardDeviation;                                       // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Min;                                                     // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Max;                                                     // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Lambda;                                                  // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Offset;                                                  // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E5AK[0xC];                                   // 0x001C(0x000C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AimCorrectionSettings
	 * Size -> 0x0010
	 */
	struct FAimCorrectionSettings
	{
	public:
		EAimCorrectionStartMethod                                  StartMethod;                                             // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YFH5[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StartDelay;                                              // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAutoAimDataAsset*                                   AutoAimSettings;                                         // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttributeValueProxy
	 * Size -> 0x0018
	 */
	struct FAttributeValueProxy
	{
	public:
		EAttributeValueSource                                      Source;                                                  // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DVPK[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Value;                                                   // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAttributeType*                                      AttributeType;                                           // 0x0008(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1G91[0x8];                                   // 0x0010(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.CoopWeaponAnimation
	 * Size -> 0x0030
	 */
	struct FCoopWeaponAnimation
	{
	public:
		bool                                                       bUseAnimSets;                                            // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BPS7[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                AnimSetName;                                             // 0x0004(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CharacterAssetLinkName;                                  // 0x000C(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                WeaponAssetLinkName;                                     // 0x0014(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6D98[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimMontage*                                        WeaponAnimation;                                         // 0x0020(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        CharacterAnimation;                                      // 0x0028(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AIMeleeCommitmentAndHitDistanceConfig
	 * Size -> 0x0018
	 */
	struct FAIMeleeCommitmentAndHitDistanceConfig
	{
	public:
		float                                                      BaseHitDistance;                                         // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZTGH[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UModifiableValueDefinition*                          AggressorCommitmentHitDistanceModifier;                  // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UModifiableValueDefinition*                          TargetHitDistanceModifier;                               // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.MeleeActionMiscParams
	 * Size -> 0x0070
	 */
	struct FMeleeActionMiscParams
	{
	public:
		bool                                                       bSkipWindUp;                                             // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShouldOverrideHitBehaviour;                             // 0x0001(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMeleeAttackHitBehaviour                                   OverrideHitBehaviour;                                    // 0x0002(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOverrideBool                                              UseFallbackAttackOverride;                               // 0x0003(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OverrideMaxAngleToLaunchFallbackAttack;                  // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAlwaysSucceed;                                          // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RHMY[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseExpression                            SuccessfulImpactExpression;                              // 0x0010(0x0038) Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShouldPerformLocomotiveWindUps;                         // 0x0048(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2GP9[0x3];                                   // 0x0049(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinVariableWindUpToPerform;                              // 0x004C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShouldAlwaysPerformFixedWindUp;                         // 0x0050(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L7OY[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinVariableWindUpToForceFixedWindUp;                     // 0x0054(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRequiresCombatTarget;                                   // 0x0058(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K28N[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAttackSequence*                                     AttackSequence;                                          // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VZX9[0x8];                                   // 0x0068(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.MeleeAttack
	 * Size -> 0x0010
	 */
	struct FMeleeAttack
	{
	public:
		class UMeleeImpactProfile*                                 OverrideImpactProfile;                                   // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMeleeAttackHitBehaviour                                   HitBehaviour;                                            // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UGX4[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.MeleeHitDetectionConfig
	 * Size -> 0x0030
	 */
	struct FMeleeHitDetectionConfig
	{
	public:
		struct FMeleeAttack                                        Attack;                                                  // 0x0000(0x0010) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		class FName                                                SectionToJumpTo;                                         // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        MontageToPlay;                                           // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DesiredHitTime;                                          // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bHitDetectionCanBeEvaded;                                // 0x0024(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q0CD[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BlockWindowScalar;                                       // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DodgeWindowScalar;                                       // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AIMeleeHitDetectionNotifyStateConfig
	 * Size -> 0x0038
	 */
	struct FAIMeleeHitDetectionNotifyStateConfig
	{
	public:
		class UMeleeImpactProfile*                                 ImpactProfile;                                           // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FMeleeHitDetectionConfig                            HitDetectionConfig;                                      // 0x0008(0x0030) NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AIMeleeHitDetection
	 * Size -> 0x01A0
	 */
	struct FAIMeleeHitDetection
	{
	public:
		class UAttributeType*                                      BaseDamageAttributeType;                                 // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAttributeType*                                      BaseForceAttributeType;                                  // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A206[0x98];                                  // 0x0010(0x0098) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<int32_t, struct FAIMeleeHitDetectionNotifyStateConfig> HitDetectionConfigs;                                     // 0x00A8(0x0050) NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_R4ZL[0xA8];                                  // 0x00F8(0x00A8) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AIMovementSpeedBaseValue
	 * Size -> 0x0098
	 */
	struct FAIMovementSpeedBaseValue
	{
	public:
		struct FKnowledgeBaseExpression                            Expression;                                              // 0x0000(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRandomNumberGenerator_Float                        BaseSpeed;                                               // 0x0038(0x0028) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		float                                                      ClampedMin;                                              // 0x0060(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ClampedMax;                                              // 0x0064(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EModifierApplicationMethod                                 ModifierApplicationMethod;                               // 0x0068(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EYHM[0x7];                                   // 0x0069(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRandomNumberGenerator_Float                        BaseAcceleration;                                        // 0x0070(0x0028) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AIMovementSpeedModifier
	 * Size -> 0x0040
	 */
	struct FAIMovementSpeedModifier
	{
	public:
		struct FKnowledgeBaseExpression                            Expression;                                              // 0x0000(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Value;                                                   // 0x0038(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M58D[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.StimID
	 * Size -> 0x0004
	 */
	struct FStimID
	{
	public:
		uint32_t                                                   ID;                                                      // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.StimEmitter
	 * Size -> 0x0028
	 */
	struct FStimEmitter
	{
	public:
		struct FStimChooser                                        StimTemplate;                                            // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       AttachStimToEmitter;                                     // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VVHO[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TWeakObjectPtr<class AActor>                               Instigator;                                              // 0x0014(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsActive;                                               // 0x001C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5MVF[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FStimID                                             CurrentStimID;                                           // 0x0020(0x0004) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_1934[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.InstanceOverrideAlarmData
	 * Size -> 0x0048
	 */
	struct FInstanceOverrideAlarmData
	{
	public:
		struct FKnowledgeBaseExpression                            Expression;                                              // 0x0000(0x0038) Edit, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UScriptedSequenceStage*>                      OverriddenStages;                                        // 0x0038(0x0010) Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.FallbackAlarmData
	 * Size -> 0x0040
	 */
	struct FFallbackAlarmData
	{
	public:
		struct FKnowledgeBaseExpression                            Expression;                                              // 0x0000(0x0038) Edit, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UScriptedSequenceDataAsset*                          ScriptedSequenceDataAsset;                               // 0x0038(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AmbientLookTargetDefinition
	 * Size -> 0x0030
	 */
	struct FAmbientLookTargetDefinition
	{
	public:
		class UStimTemplate*                                       Stim;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRandomNumberGenerator_Float                        LookDuration;                                            // 0x0008(0x0028) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactData
	 * Size -> 0x000C
	 */
	struct FDeadIsland_FImpactData
	{
	public:
		bool                                                       bCanCauseBreak;                                          // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanCauseDismember;                                      // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSpawnLimbsOnDismember;                                  // 0x0002(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanCut;                                                 // 0x0003(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanCauseBisection;                                      // 0x0004(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EGID[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BisectionChance;                                         // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.RemapParameterToRangeHelper
	 * Size -> 0x00F0
	 */
	struct FRemapParameterToRangeHelper
	{
	public:
		struct FKnowledgeBaseExpression                            InputValueStartRangeExpression;                          // 0x0000(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseExpression                            InputValueEndRangeExpression;                            // 0x0038(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EScalingMethod                                             ScalingMethod;                                           // 0x0070(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OTVZ[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseExpression                            OutputValueAtStartRangeExpression;                       // 0x0078(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseExpression                            OutputValueAtEndRangeExpression;                         // 0x00B0(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         OutputRangeScalingCurve;                                 // 0x00E8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactSourceInfo
	 * Size -> 0x0018
	 */
	struct FImpactSourceInfo
	{
	public:
		struct FEventInstigator                                    Instigator;                                              // 0x0000(0x0010) BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic
		TWeakObjectPtr<class AActor>                               DamageCauser;                                            // 0x0010(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AnimatedReactionMontageParams
	 * Size -> 0x0018
	 */
	struct FAnimatedReactionMontageParams
	{
	public:
		float                                                      MontagePlayRate;                                         // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MontagePlayWeight;                                       // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MontageStartDelay;                                       // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0HLE[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimMontage*                                        Montage;                                                 // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.MoveTargetBasis
	 * Size -> 0x0018
	 */
	struct FMoveTargetBasis
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Velocity;                                                // 0x000C(0x000C) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.SharedLocomotionState
	 * Size -> 0x0068
	 */
	struct FSharedLocomotionState
	{
	public:
		unsigned char                                              UnknownData_E7HV[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             FinalDestination;                                        // 0x0008(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FMoveTargetBasis                                    FinalDestinationBasis;                                   // 0x0014(0x0018) Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic
		struct FMoveTargetBasisBehaviour                           FinalDestinationBasisBehaviour;                          // 0x002C(0x0008) Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             ExternalVelocity;                                        // 0x0034(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSpeed;                                                // 0x0040(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Acceleration;                                            // 0x0044(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             DirectionAtFinalDestination;                             // 0x0048(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EStrafeMode                                                StrafeMode;                                              // 0x0054(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1OEH[0x3];                                   // 0x0055(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ULocomotionStance*                                   DesiredStance;                                           // 0x0058(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_40NO[0x8];                                   // 0x0060(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AnimationMasterLocomotionState
	 * Size -> 0x0060 (FullSize[0x00C8] - InheritedSize[0x0068])
	 */
	struct FAnimationMasterLocomotionState : public FSharedLocomotionState
	{
	public:
		TArray<struct FVector>                                     Path;                                                    // 0x0068(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      ServerTime;                                              // 0x0078(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Location;                                                // 0x007C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Direction;                                               // 0x0088(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Velocity;                                                // 0x0094(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TimeSinceMovementTick;                                   // 0x00A0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SyncStateID;                                             // 0x00A4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInSlaveAuthoritativeSyncState;                          // 0x00A8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V5QY[0x3];                                   // 0x00A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    PathID;                                                  // 0x00AC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    PathLength;                                              // 0x00B0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DestinationPointIndex;                                   // 0x00B4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsRepathing;                                            // 0x00B8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENavigationState                                           NavigationState;                                         // 0x00B9(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2NED[0x2];                                   // 0x00BA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             StrafeTarget;                                            // 0x00BC(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.SharedLookAtState
	 * Size -> 0x0020
	 */
	struct FSharedLookAtState
	{
	public:
		struct FVector                                             LookTarget;                                              // 0x0000(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShouldLook;                                             // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RG11[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             AimTarget;                                               // 0x0010(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShouldAim;                                              // 0x001C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3GJX[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AnimationMasterLookAtState
	 * Size -> 0x0000 (FullSize[0x0020] - InheritedSize[0x0020])
	 */
	struct FAnimationMasterLookAtState : public FSharedLookAtState
	{	};

	/**
	 * ScriptStruct DeadIsland.VocalAsset
	 * Size -> 0x0038
	 */
	struct FVocalAsset
	{
	public:
		class UAkAudioEvent*                                       AudioEvent;                                              // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDialogueTriggerChooser                             DialogueTrigger;                                         // 0x0008(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		class UDialogueTriggerDataAsset*                           DialogueTriggerDataAsset;                                // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FKnowledgeBaseValueSelector>                 ContextKnowledgeBaseValues;                              // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.TriggerNearbyConfigDataBP
	 * Size -> 0x0020
	 */
	struct FTriggerNearbyConfigDataBP
	{
	public:
		float                                                      MaxDistance;                                             // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TriggerCount;                                            // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              Factions[0x10];                                          // 0x0008(0x0010) UNKNOWN PROPERTY: ArrayProperty
		bool                                                       bOnlyConsiderParticipants;                               // 0x0018(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOnlyConsiderNonParticipants;                            // 0x0019(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_69MX[0x6];                                   // 0x001A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.TargetPointInfoGenerator
	 * Size -> 0x0028
	 */
	struct FTargetPointInfoGenerator
	{
	public:
		ETargetPointInfoType                                       Type;                                                    // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_74D5[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                BoneOrSocketName;                                        // 0x0004(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsSocket;                                               // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SHUK[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             LocalSpaceOffset;                                        // 0x0010(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            LocalRotationOffset;                                     // 0x001C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactSensorSweepSettings
	 * Size -> 0x0014
	 */
	struct FImpactSensorSweepSettings
	{
	public:
		bool                                                       bUseSensorRadiusForSweepRadius;                          // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J8V9[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SweepTestSphereRadius;                                   // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESensorSweepMethod                                         SensorSweepMethod;                                       // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M47K[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SweepLengthAsFractionOfCamToSensorDist;                  // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableOcclusionChecks;                                  // 0x0010(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XANA[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetTraversalGroupState
	 * Size -> 0x0020
	 */
	struct FAnimSetTraversalGroupState
	{
	public:
		class UAnimSetSelectionOrder*                              Order;                                                   // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1Y7A[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bExpressionValue;                                        // 0x0018(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O8OF[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetVelocityAngleGroupState
	 * Size -> 0x0010
	 */
	struct FAnimSetVelocityAngleGroupState
	{
	public:
		class UAnimSetSelectionOrder*                              Order;                                                   // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DN8L[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetVelocitySpeedGroupState
	 * Size -> 0x0058
	 */
	struct FAnimSetVelocitySpeedGroupState
	{
	public:
		TArray<struct FAnimSetVelocityAngleGroupState>             AngleGroupStates;                                        // 0x0000(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B2TF[0x48];                                  // 0x0010(0x0048) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.FactConfigurationHelper
	 * Size -> 0x0020
	 */
	struct FFactConfigurationHelper
	{
	public:
		TArray<struct FKnowledgeBaseValueSelector>                 Facts;                                                   // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FKnowledgeBaseFactKey>                       CounterFacts;                                            // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetCollectionItem
	 * Size -> 0x0030
	 */
	struct FAnimSetCollectionItem
	{
	public:
		class UClass*                                              AnimSetClass;                                            // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimSetData*                                        AnimSetData;                                             // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             AnimAsset;                                               // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             InstancedAnimAsset;                                      // 0x0018(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObjectSet*                                          AnimSet;                                                 // 0x0020(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5IQ0[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetItem
	 * Size -> 0x0040
	 */
	struct FAnimSetItem
	{
	public:
		float                                                      Weight;                                                  // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S8IQ[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UObject*                                             Asset;                                                   // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UObject*                                             InstancedAsset;                                          // 0x0010(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              AsyncAsset[0x28];                                        // 0x0018(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetGroup
	 * Size -> 0x0060
	 */
	struct FAnimSetGroup
	{
	public:
		class FName                                                Name;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseExpression                            Expression;                                              // 0x0008(0x0038) Edit, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              Order;                                                   // 0x0040(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowSingleNullEntry;                                   // 0x0048(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YM48[0x7];                                   // 0x0049(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAnimSetItem>                                Items;                                                   // 0x0050(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetTraversalGroup
	 * Size -> 0x0050 (FullSize[0x00B0] - InheritedSize[0x0060])
	 */
	struct FAnimSetTraversalGroup : public FAnimSetGroup
	{
	public:
		struct FFloatRange                                         AscentRange;                                             // 0x0060(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FFloatRange                                         DescentRange;                                            // 0x0070(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FFloatRange                                         ObstacleWidthRange;                                      // 0x0080(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FFloatRange                                         HeightClearanceRange;                                    // 0x0090(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FFloatRange                                         DistanceRange;                                           // 0x00A0(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetVelocityAngleGroup
	 * Size -> 0x0030
	 */
	struct FAnimSetVelocityAngleGroup
	{
	public:
		bool                                                       bMatchesZeroVelocity;                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TZ4I[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              Order;                                                   // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FAnimSetItem>                                Items;                                                   // 0x0010(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FVector                                             AngleRangeCentreDirection;                               // 0x0020(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      CosAngleRangeCentreExtent;                               // 0x002C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.AnimSetVelocitySpeedGroup
	 * Size -> 0x0058
	 */
	struct FAnimSetVelocitySpeedGroup
	{
	public:
		struct FKnowledgeBaseExpression                            Expression;                                              // 0x0000(0x0038) Edit, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FFloatRange                                         SpeedRange;                                              // 0x0038(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FAnimSetVelocityAngleGroup>                  AngleGroups;                                             // 0x0048(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.OverlappedAreaInstanceInfo
	 * Size -> 0x0010
	 */
	struct FOverlappedAreaInstanceInfo
	{
	public:
		TWeakObjectPtr<class UAreaOfEffectBase>                    AreaOfEffect;                                            // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V4RE[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.OverlappedAreaTypeInfo
	 * Size -> 0x0010
	 */
	struct FOverlappedAreaTypeInfo
	{
	public:
		TArray<struct FOverlappedAreaInstanceInfo>                 AreaInstances;                                           // 0x0000(0x0010) ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ArmSwayLayerData
	 * Size -> 0x0004
	 */
	struct FArmSwayLayerData
	{
	public:
		float                                                      SmoothTime;                                              // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentSetup
	 * Size -> 0x0024
	 */
	struct FAttachmentSetup
	{
	public:
		class FName                                                AttachmentName;                                          // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseFactKey                               AttachedFact;                                            // 0x0008(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCreateAttachedFact;                                     // 0x0014(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5LKM[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseFactKey                               BreakingConditionsFactName;                              // 0x0018(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentHealthConfig
	 * Size -> 0x0010
	 */
	struct FAttachmentHealthConfig
	{
	public:
		float                                                      MaxHealthFromTheFractionOfOwnersMaxHealth;               // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseFactKey                               HealthFactName;                                          // 0x0004(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentImpactConfig
	 * Size -> 0x0014
	 */
	struct FAttachmentImpactConfig
	{
	public:
		int32_t                                                    RequiredNumberOfImpacts;                                 // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseFactKey                               ImpactsRequiredFactName;                                 // 0x0004(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bImpactsInitialised;                                     // 0x0010(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YSCO[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentDamageAndImpactsToIgnoreConfig
	 * Size -> 0x0020
	 */
	struct FAttachmentDamageAndImpactsToIgnoreConfig
	{
	public:
		TArray<struct FKnowledgeBaseFactKey>                       IgnoreImpactsWhileTheseFactsAreActive;                   // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FKnowledgeBaseFactKey>                       ImpactFactsToIgnore;                                     // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentRemovalConfig
	 * Size -> 0x001C
	 */
	struct FAttachmentRemovalConfig
	{
	public:
		bool                                                       bRemoveAttachment;                                       // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZJBP[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                DetachmentEventName;                                     // 0x0004(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseFactKey                               ForcedDetachmentImpactFact;                              // 0x000C(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceRequirementForForcedDetachment;                     // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentFuryConfig
	 * Size -> 0x0010
	 */
	struct FAttachmentFuryConfig
	{
	public:
		bool                                                       bFuryConditionsToForceDetach;                            // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YT8Z[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FuryDamageAsAFractionOfMaxHealthRequirement;             // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCurrentHealthFractionInsteadOfMaxHealth;                // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7AG4[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FuryForceRequirement;                                    // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttachmentPieceSettings
	 * Size -> 0x00A8
	 */
	struct FAttachmentPieceSettings
	{
	public:
		struct FAttachmentSetup                                    RequiredAttachmentSetup;                                 // 0x0000(0x0024) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FAttachmentHealthConfig                             AttachmentHealthSettings;                                // 0x0024(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FAttachmentImpactConfig                             AttachmentImpactSettings;                                // 0x0034(0x0014) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FAttachmentDamageAndImpactsToIgnoreConfig           AttachmentImpactsAndDamageToIgnore;                      // 0x0048(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FAttachmentRemovalConfig                            AttachmentRemovalSettings;                               // 0x0068(0x001C) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FAttachmentFuryConfig                               AttachmentFurySettings;                                  // 0x0084(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2MW5[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UPerkDefinition*>                             UniqueAttachmentPerk;                                    // 0x0098(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.StateTransmissionSettings
	 * Size -> 0x0020
	 */
	struct FStateTransmissionSettings
	{
	public:
		ETransmittableStatus                                       StatusType;                                              // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6I7E[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TransmissionRadius;                                      // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsActivation;                                           // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WLIU[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Strength;                                                // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAddBlockReason;                                         // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5SLB[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                BlockReason;                                             // 0x0014(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlockDuration;                                           // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.StatusEffectSettings
	 * Size -> 0x0018
	 */
	struct FStatusEffectSettings
	{
	public:
		class UClass*                                              StatusEffectType;                                        // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              StatusEffectIgnoredForReactions;                         // 0x0008(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S92Q[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StatusEffectTriggerChance;                               // 0x000C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStatusEffectParams*                                 StatusEffectParams;                                      // 0x0010(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.StatusEffectArray
	 * Size -> 0x0010
	 */
	struct FStatusEffectArray
	{
	public:
		TArray<struct FStatusEffectSettings>                       Effects;                                                 // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AccumulatingEffectTypeAndValue
	 * Size -> 0x000C
	 */
	struct FAccumulatingEffectTypeAndValue
	{
	public:
		EAccumulatingEffectType                                    EffectType;                                              // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bApplyMaxValue;                                          // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2XEZ[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ValueToApply;                                            // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanExtendEffectDuration;                                 // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SFEG[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AccumulatingEffectArray
	 * Size -> 0x0010
	 */
	struct FAccumulatingEffectArray
	{
	public:
		TArray<struct FAccumulatingEffectTypeAndValue>             AccumulatingEffects;                                     // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.PhysicalizedWorldBroadcastSettings
	 * Size -> 0x0014
	 */
	struct FPhysicalizedWorldBroadcastSettings
	{
	public:
		class FName                                                ID;                                                      // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBroadcastInRadius;                                      // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BNOZ[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Radius;                                                  // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPhysicalizedWorldAffectedActorsPolicy                     AffectedActorPolicy;                                     // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YGGK[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.PhysicalizedWorldStateBroadcastSettings
	 * Size -> 0x001C
	 */
	struct FPhysicalizedWorldStateBroadcastSettings
	{
	public:
		struct FPhysicalizedWorldBroadcastSettings                 Settings;                                                // 0x0000(0x0014) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bBeginState;                                             // 0x0014(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bFiniteDuration;                                         // 0x0015(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8XWI[0x2];                                   // 0x0016(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Duration;                                                // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.PhysicalizedWorldStatesAndEvents
	 * Size -> 0x0020
	 */
	struct FPhysicalizedWorldStatesAndEvents
	{
	public:
		TArray<struct FPhysicalizedWorldBroadcastSettings>         Events;                                                  // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FPhysicalizedWorldStateBroadcastSettings>    States;                                                  // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactSettings
	 * Size -> 0x00C8
	 */
	struct FImpactSettings
	{
	public:
		float                                                      WeaponSizeMultiplier;                                    // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OM9W[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FStateTransmissionSettings>                  EnvironmentalMessagesToTransmit;                         // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, RepSkip, NativeAccessSpecifierPublic
		struct FStatusEffectArray                                  StatusEffects;                                           // 0x0018(0x0010) Edit, BlueprintVisible, RepSkip, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FAccumulatingEffectArray                            AccumulatingEffectsToApply;                              // 0x0028(0x0010) Edit, BlueprintVisible, RepSkip, NativeAccessSpecifierPublic
		struct FPhysicalizedWorldStatesAndEvents                   PhysicalizedWorldStatesAndEventsToApply;                 // 0x0038(0x0020) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FStimChooser                                        ImpactStim;                                              // 0x0058(0x0010) Edit, BlueprintVisible, RepSkip, NoDestructor, NativeAccessSpecifierPublic
		float                                                      ImpactStimRadius;                                        // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ImpactStimDuration;                                      // 0x006C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHitEffectTree*                                      AttackerEffectTree;                                      // 0x0070(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHitEffectTree*                                      VictimEffectTree;                                        // 0x0078(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHitEffectTree*                                      EnvironmentEffectTree;                                   // 0x0080(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WorldSpaceImpulseMagnitude;                              // 0x0088(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PhysicalizedReactionMagnitude;                           // 0x008C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDoesCancelHealthRegen;                                  // 0x0090(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanCauseCosmeticFlinches;                               // 0x0091(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanLaunch;                                              // 0x0092(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P3B8[0x5];                                   // 0x0093(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ULaunchSettings*                                     LaunchSettings;                                          // 0x0098(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDamageLevelScalingPolicy                                  DamageLevelScalingPolicy;                                // 0x00A0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAccumulatingEffectScalingPolicy                           AccumulatingEffectsScalingPolicy;                        // 0x00A1(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DOY9[0x6];                                   // 0x00A2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAttributeLevelScalingSettingsWrapper*               OverrideDefaultDamageScalingSettings;                    // 0x00A8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAttributeLevelScalingSettingsWrapper*               OverrideDefaultAccumulatingEffectsScalingSettings;       // 0x00B0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FKnowledgeBaseValueSelector>                 CustomImpactFacts;                                       // 0x00B8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactConfiguration
	 * Size -> 0x00D8
	 */
	struct FImpactConfiguration
	{
	public:
		bool                                                       bUseImpactSettingsPreset;                                // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J6M0[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UImpactSettingsPreset*                               PresetSettings;                                          // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FImpactSettings                                     Settings;                                                // 0x0010(0x00C8) Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttackDefinitionAttack
	 * Size -> 0x0018
	 */
	struct FAttackDefinitionAttack
	{
	public:
		class UAnimMontage*                                        FixedWindUpMontage;                                      // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        Montage;                                                 // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AttackLocationOffset;                                    // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OverrideSuccessDistance;                                 // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AttackDefinitionWindUp
	 * Size -> 0x0078
	 */
	struct FAttackDefinitionWindUp
	{
	public:
		class UWindUpDefinition*                                   WindUp;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FKnowledgeBaseExpression                            Condition;                                               // 0x0008(0x0038) Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Duration;                                                // 0x0040(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CancelInvisibleWindUpAfterSeconds;                       // 0x0044(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WindUpVisibleAtDistance;                                 // 0x0048(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CancelWindUpAtDistance;                                  // 0x004C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CannotCancelWindUpWithinDistance;                        // 0x0050(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CancelWindUpAfterSeconds;                                // 0x0054(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMeleeImpactProfile*                                 DefaultImpactProfile;                                    // 0x0058(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxForwardLeadDistance;                                  // 0x0060(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxBackwardLeadistance;                                  // 0x0064(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FAttackDefinitionAttack>                     Attacks;                                                 // 0x0068(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.LevelToValueArray
	 * Size -> 0x0010
	 */
	struct FLevelToValueArray
	{
	public:
		TArray<float>                                              AttributeValueAtLevel;                                   // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AutoAimSensitivityCurves
	 * Size -> 0x0010
	 */
	struct FAutoAimSensitivityCurves
	{
	public:
		class UCurveFloat*                                         ControllerCurve;                                         // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         MouseAndKeyboardCurve;                                   // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.TargetSelectionScoreSettings
	 * Size -> 0x0050
	 */
	struct FTargetSelectionScoreSettings
	{
	public:
		float                                                      MaxDegreesFromForwardDir;                                // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DistanceHeuristicWeighting;                              // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AngleHeuristicWeighting;                                 // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HorizontalVsVerticalAngularScoreDistribution;            // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScreenSpaceOverlapHeuristicWeighting;                    // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDebugDraw;                                              // 0x0014(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTargetMustMeetKBRequirements;                           // 0x0015(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTargetWithoutKBComponentTreatedAsValid;                 // 0x0016(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BY3Y[0x1];                                   // 0x0017(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseExpression                            TargetEligibilityExpression;                             // 0x0018(0x0038) Edit, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.TargetSelectionSettings
	 * Size -> 0x0060
	 */
	struct FTargetSelectionSettings
	{
	public:
		float                                                      MinDistance;                                             // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDistance;                                             // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bProhibitModificationIfRequestDirectionAlreadyHitsTarget; // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GSDM[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTargetSelectionScoreSettings                       ScoreSettings;                                           // 0x0010(0x0050) Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.DynamicContextScaleMultipliers
	 * Size -> 0x0020
	 */
	struct FDynamicContextScaleMultipliers
	{
	public:
		bool                                                       bDistanceScalingActive;                                  // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1UAG[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ScaleMultiplierStartDistance;                            // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScaleMultiplierEndDistance;                              // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ScaleMultiplierAppliedAtStartDistance;                   // 0x000C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GlobalScaleMultiplier;                                   // 0x0010(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAdjustSillhouetteTargetPointsInsideMesh;                // 0x0014(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8PBI[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SillhoueteEdgeToContextCenterAdjustFraction;             // 0x0018(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaximumSillhoueteEdgeToContextCenterAdjustDistance;      // 0x001C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ViewTargetParams
	 * Size -> 0x003C
	 */
	struct FViewTargetParams
	{
	public:
		float                                                      SmoothTime;                                              // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PitchSmoothTime;                                         // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDegreesPerSecondAdjustRate;                           // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDisableIfTargetTooFarFromViewDir;                       // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1D4Q[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ToleratedAngularDeviationFromViewDir;                    // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUserInputCanDisable;                                    // 0x0014(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IX7B[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ToleratedInputDirectionDeviationInDegrees;               // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EViewTargetDiffOutcome                                     DiffSubstantialEnoughOutcome;                            // 0x001C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUnregisterRequestIfSourceIsAtTargetPoint;               // 0x001D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VVWN[0x2];                                   // 0x001E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TargetPointToleranceYawAxis;                             // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetPointTolerancePitchAxis;                           // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bYawAdjustEnabled;                                       // 0x0028(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EViewTargetValueSource                                     YawAdjustValueSource;                                    // 0x0029(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FHKH[0x2];                                   // 0x002A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OptionalTargetYawAbsoluteValue;                          // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bPitchAdjustEnabled;                                     // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EViewTargetValueSource                                     PitchAdjustValueSource;                                  // 0x0031(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_81JK[0x2];                                   // 0x0032(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OptionalTargetPitchAbsoluteValue;                        // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AutoAimSensitivity;                                      // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.AutoAimParameters
	 * Size -> 0x0138
	 */
	struct FAutoAimParameters
	{
	public:
		struct FTargetSelectionSettings                            ActorSelectionSettings;                                  // 0x0000(0x0060) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FTargetSelectionSettings                            ContextSelectionSettings;                                // 0x0060(0x0060) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FString                                              OptionalTargetContextConfigSetName;                      // 0x00C0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDynamicContextScaleMultipliers                     DynamicContextScaleMultipliers;                          // 0x00D0(0x0020) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FViewTargetParams                                   ViewGuidanceSettings;                                    // 0x00F0(0x003C) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		float                                                      ReticleMaxDistance;                                      // 0x012C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EffectiveAttackRange;                                    // 0x0130(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DD80[0x4];                                   // 0x0134(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.AutophageContributionSource
	 * Size -> 0x001C
	 */
	struct FAutophageContributionSource
	{
	public:
		float                                                      IncreaseQuantity;                                        // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D3MY[0x18];                                  // 0x0004(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.ActiveAutophageEffects
	 * Size -> 0x0038
	 */
	struct FActiveAutophageEffects
	{
	public:
		unsigned char                                              UnknownData_L8Z9[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UAutophageEffectTierDefinition*>              ActiveAutophageEffectTiers;                              // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGuid>                                       ActivePerks;                                             // 0x0018(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGuid>                                       ActiveModifiers;                                         // 0x0028(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ModifierAndValue
	 * Size -> 0x0010
	 */
	struct FModifierAndValue
	{
	public:
		class UModifiableValueDefinition*                          Modifier;                                                // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Value;                                                   // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XLDW[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.ZombieWeightedList
	 * Size -> 0x0018
	 */
	struct FZombieWeightedList
	{
	public:
		float                                                      Weight;                                                  // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YW9H[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      ZombieTypes;                                             // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ZombieSpawnEntry
	 * Size -> 0x0020
	 */
	struct FZombieSpawnEntry
	{
	public:
		uint32_t                                                   From;                                                    // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   To;                                                      // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                ZombieRank;                                              // 0x0008(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5YG7[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FZombieWeightedList>                         ZombiesToSpawn;                                          // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.WeaponFilter
	 * Size -> 0x0090
	 */
	struct FWeaponFilter
	{
	public:
		bool                                                       bFilterByImpactType;                                     // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VRWU[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<EImpactType>                                        ImpactTypes;                                             // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       bFilterBySize;                                           // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ENTJ[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<ESizeCategory>                                      SizeCategories;                                          // 0x0020(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       bFilterByHoldType;                                       // 0x0030(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GBWD[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<EHoldCategory>                                      HoldCategories;                                          // 0x0038(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       bFilterByKBFact;                                         // 0x0048(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VBFO[0x7];                                   // 0x0049(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseExpression                            KBExpression;                                            // 0x0050(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EFilterRule                                                FilterRule;                                              // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FM0Z[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.BodyPartImpalingFilter
	 * Size -> 0x0030
	 */
	struct FBodyPartImpalingFilter
	{
	public:
		TArray<class FName>                                        BodyPartNames;                                           // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<struct FWeaponFilter>                               WeaponFilters;                                           // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FString                                              ArrayElementTitleText;                                   // 0x0020(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.GameplayState
	 * Size -> 0x0002
	 */
	struct FGameplayState
	{
	public:
		EBodyPartGameplayState                                     GameplayState;                                           // 0x0000(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSuppressResponses;                                      // 0x0001(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.DSDamageDataForBodyPart
	 * Size -> 0x0008
	 */
	struct FDSDamageDataForBodyPart
	{
	public:
		bool                                                       bHeavyAttack;                                            // 0x0000(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanCauseBreak;                                          // 0x0001(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanCauseDismember;                                      // 0x0002(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSpawnLimbsOnDismember;                                  // 0x0003(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Force;                                                   // 0x0004(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ClippedGlassSettings
	 * Size -> 0x0008
	 */
	struct FClippedGlassSettings
	{
	public:
		float                                                      ImpulseJitterPercent;                                    // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AwakeTimeSeconds;                                        // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.BreathingAudioMouthAnimationConfigState
	 * Size -> 0x000C
	 */
	struct FBreathingAudioMouthAnimationConfigState
	{
	public:
		float                                                      MiniumumMouthAdditive;                                   // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaximumMouthAdditive;                                    // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bClampMouthAdditiveFraction;                             // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1DDL[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.DataAssetReflector
	 * Size -> 0x0030
	 */
	struct FDataAssetReflector
	{
	public:
		struct FBlackboardKeySelector                              AssetBlackboardKey;                                      // 0x0000(0x0028) Edit, NativeAccessSpecifierPublic
		class FName                                                AssetPropertyName;                                       // 0x0028(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.FloatValueSource
	 * Size -> 0x0060
	 */
	struct FFloatValueSource
	{
	public:
		EValueSource                                               Source;                                                  // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RT3S[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ValueRaw;                                                // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FBlackboardKeySelector                              ValueBlackboard;                                         // 0x0008(0x0028) Edit, NativeAccessSpecifierPublic
		struct FDataAssetReflector                                 ValueDataAsset;                                          // 0x0030(0x0030) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.OffsetCheckCondition
	 * Size -> 0x001C
	 */
	struct FOffsetCheckCondition
	{
	public:
		struct FVector                                             Direction;                                               // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOffsetCheckSpace                                          Space;                                                   // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EOffsetCheckPredicate                                      Predicate;                                               // 0x000D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9ERP[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Value;                                                   // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Tolerance;                                               // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEitherDirection;                                        // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OVLQ[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.SurfacePenetrationSettings
	 * Size -> 0x0008
	 */
	struct FSurfacePenetrationSettings
	{
	public:
		bool                                                       bPenetrationAllowed;                                     // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XD45[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PenetrationHPReduction;                                  // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.CameraModifierVariables
	 * Size -> 0x0014
	 */
	struct FCameraModifierVariables
	{
	public:
		EModifierType                                              CurrentType;                                             // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EValueType                                                 ValueType;                                               // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VIO5[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DesiredValue;                                            // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O0IF[0xC];                                   // 0x0008(0x000C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.MenuElementObjectLinkageData
	 * Size -> 0x0060
	 */
	struct FMenuElementObjectLinkageData
	{
	public:
		EMenuElementObjectLinkageType                              Type;                                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LTY0[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              GFxPath;                                                 // 0x0008(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ClassName;                                               // 0x0018(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              InstanceName;                                            // 0x0028(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USwfMovie*                                           LoaderSwfMovie;                                          // 0x0038(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     LoaderImageAsset;                                        // 0x0040(0x0018) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSetInitObject;                                          // 0x0058(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bElementLocksChangingType;                               // 0x0059(0x0001) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KHAH[0x6];                                   // 0x005A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.TravelRequestParams
	 * Size -> 0x0058
	 */
	struct FTravelRequestParams
	{
	public:
		class UObjectiveData*                                      DebugObjectiveData;                                      // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     OverrideEquipmentPack;                                   // 0x0008(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FSoftObjectPath                                     InitialFactState;                                        // 0x0020(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1BGF[0x20];                                  // 0x0038(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.EquippableGameEventStates
	 * Size -> 0x0010
	 */
	struct FEquippableGameEventStates
	{
	public:
		class UGameEventState*                                     WeaponEquippedState;                                     // 0x0000(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UGameEventState*                                     WeaponState;                                             // 0x0008(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.EquippableAudioParams
	 * Size -> 0x0068
	 */
	struct FEquippableAudioParams
	{
	public:
		struct FAkPostEventExtraParams                             PostEventExtraParams;                                    // 0x0000(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EC9W[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UAudioFactNameSwitchGroupNamePair*>           AudioFactsAndSwitchGroups;                               // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UAudioFactNameRTPCNamePair*>                  AudioFactsAndRTPCs;                                      // 0x0020(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       OnAssignedEvent;                                         // 0x0030(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              OnRemovedEvent[0x28];                                    // 0x0038(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		class UAkAuxBus*                                           EarlyReflectionBus;                                      // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.EquippableData
	 * Size -> 0x0170
	 */
	struct FEquippableData
	{
	public:
		class UHeldItemData*                                       HeldItemData;                                            // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              ModelActor;                                              // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDataTableRowHandle                                 HoldOffset;                                              // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bEnableHoldingHandIK_1_UsingBone;                        // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ME4C[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ULimbIKConfigDefinition*                             HoldingLeftHandIKConfig;                                 // 0x0028(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ULimbIKConfigDefinition*                             HoldingRightHandIKConfig;                                // 0x0030(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                HoldingLeftHandIKBoneName;                               // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                HoldingRightHandIKBoneName;                              // 0x0040(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableHoldingHandIK_2_UsingTable;                       // 0x0048(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IVXG[0x7];                                   // 0x0049(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ULimbIKConfigDefinition*                             HoldingLeftHandIKConfig_2_UsingTable;                    // 0x0050(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ULimbIKConfigDefinition*                             HoldingRightHandIKConfig_2_UsingTable;                   // 0x0058(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDataTableRowHandle                                 HandIKTransforms;                                        // 0x0060(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		class FName                                                HoldingHandIK_2_RelativeCharacterBoneForTableTransforms; // 0x0070(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableHoldingHandIK_3_UsingSocket;                      // 0x0078(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N4JX[0x7];                                   // 0x0079(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ULimbIKConfigDefinition*                             HoldingLeftHandIKConfig_3_UsingSocket;                   // 0x0080(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ULimbIKConfigDefinition*                             HoldingRightHandIKConfig_3_UsingSocket;                  // 0x0088(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                HoldingLeftHandIKSocketName;                             // 0x0090(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                HoldingRightHandIKSocketName;                            // 0x0098(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EHoldCategory                                              HoldStyle;                                               // 0x00A0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESizeCategory                                              SizeCategory;                                            // 0x00A1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EImpactType                                                ImpactType;                                              // 0x00A2(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9XW1[0xD];                                   // 0x00A3(0x000D) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          OffhandRelativeTransform;                                // 0x00B0(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FKnowledgeBaseValueSelector>                 FactsSetWhenHeld;                                        // 0x00E0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UAkSwitchValue*>                              AkSwitchValues;                                          // 0x00F0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FEquippableAudioParams                              AudioParams;                                             // 0x0100(0x0068) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic
		float                                                      ArmSwayStrengthMultiplier;                               // 0x0168(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ArmSwayLagMultiplier;                                    // 0x016C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.MeleeSweepParams
	 * Size -> 0x0020
	 */
	struct FMeleeSweepParams
	{
	public:
		float                                                      TraceDistance;                                           // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TraceHeight;                                             // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StabTraceDistance;                                       // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StabSphereRadius;                                        // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SocketName;                                              // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                StabDisplacementCurveName;                               // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactOnCollisionParams_RequestBase
	 * Size -> 0x0040
	 */
	struct FImpactOnCollisionParams_RequestBase
	{
	public:
		unsigned char                                              UnknownData_06EN[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UPrimitiveComponent*                                 Collider;                                                // 0x0008(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FEventInstigator                                    Instigator;                                              // 0x0010(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		TArray<class AActor*>                                      ActorsToIgnore;                                          // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      ActorTypesToIgnore;                                      // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactOnCollisionParams_HitRequest
	 * Size -> 0x0000 (FullSize[0x0040] - InheritedSize[0x0040])
	 */
	struct FImpactOnCollisionParams_HitRequest : public FImpactOnCollisionParams_RequestBase
	{	};

	/**
	 * ScriptStruct DeadIsland.ImpactOnCollisionParams_OverlapRequest
	 * Size -> 0x0010 (FullSize[0x0050] - InheritedSize[0x0040])
	 */
	struct FImpactOnCollisionParams_OverlapRequest : public FImpactOnCollisionParams_RequestBase
	{
	public:
		TArray<ECollisionChannel>                                  CollisionObjectTypes;                                    // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ImpactOnCollisionDetection_InstigatorDependency
	 * Size -> 0x0028
	 */
	struct FImpactOnCollisionDetection_InstigatorDependency
	{
	public:
		struct FEventInstigator                                    Instigator;                                              // 0x0000(0x0010) NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FGuid>                                       DependentRequests;                                       // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       bBoundControllerEndPlay;                                 // 0x0020(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBoundPawnEndPlay;                                       // 0x0021(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JEGI[0x6];                                   // 0x0022(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.CentralNotificationLocationNameParams
	 * Size -> 0x0020
	 */
	struct FCentralNotificationLocationNameParams
	{
	public:
		struct FSoftObjectPath                                     LocationImage;                                           // 0x0000(0x0018) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       LocationAudio;                                           // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.MissionTelemetryHandler
	 * Size -> 0x0048
	 */
	struct FMissionTelemetryHandler
	{
	public:
		class UQuestUIEntity*                                      QuestUIEntity;                                           // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              MissionName;                                             // 0x0008(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              MissionNamespace;                                        // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              MissionTypeName;                                         // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              MissionFileName;                                         // 0x0038(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.QuestUIFlourishParams
	 * Size -> 0x00A8
	 */
	struct FQuestUIFlourishParams
	{
	public:
		struct FGuid                                               QuestGuid;                                               // 0x0000(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                QuestName;                                               // 0x0010(0x0018) NativeAccessSpecifierPublic
		class FText                                                QuestNameAllCaps;                                        // 0x0028(0x0018) NativeAccessSpecifierPublic
		EQuestUIState                                              FlourishState;                                           // 0x0040(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6M2U[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDIMissionType*                                      MissionType;                                             // 0x0048(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UGameReward*                                         Reward;                                                  // 0x0050(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowUntrackedObjectiveUpdates;                          // 0x0058(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8TFG[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FMissionTelemetryHandler                            MissionTelemetryHandler;                                 // 0x0060(0x0048) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ObjectiveUIQuestData
	 * Size -> 0x0003
	 */
	struct FObjectiveUIQuestData
	{
	public:
		EUIAudioTriggerEvent                                       ObjectiveAudio;                                          // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bQuestIsTracked;                                         // 0x0001(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowUpdatesEvenIfQuestUntracked;                        // 0x0002(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ObjectiveTelemetryHandler
	 * Size -> 0x0048
	 */
	struct FObjectiveTelemetryHandler
	{
	public:
		class UObjectiveUIEntity_DIObjectiveData*                  ObjectiveUIEntity;                                       // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              ObjectiveFileName;                                       // 0x0008(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              ObjectiveType;                                           // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              MissionName;                                             // 0x0028(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FString                                              MissionNamespace;                                        // 0x0038(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct DeadIsland.ObjectiveUIFlourishParams
	 * Size -> 0x0080
	 */
	struct FObjectiveUIFlourishParams
	{
	public:
		struct FGuid                                               ObjectiveGuid;                                           // 0x0000(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                Description;                                             // 0x0010(0x0018) NativeAccessSpecifierPublic
		EObjectiveUIState                                          FlourishState;                                           // 0x0028(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5AQU[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           FlourishProgress;                                        // 0x002C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FObjectiveUIQuestData                               QuestData;                                               // 0x0034(0x0003) NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_74RU[0x1];                                   // 0x0037(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FObjectiveTelemetryHandler                          TelemetryHandler;                                        // 0x0038(0x0048) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.ItemRepresentation
	 * Size -> 0x0068
	 */
	struct FItemRepresentation
	{
	public:
		class UItemArchetype*                                      Archetype;                                               // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              UIIcon;                                                  // 0x0008(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                CustomPlayerAssignedName;                                // 0x0018(0x0018) NativeAccessSpecifierPublic
		TArray<class FText>                                        Prefixes;                                                // 0x0030(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class FText                                                ShorthandName;                                           // 0x0040(0x0018) NativeAccessSpecifierPublic
		int32_t                                                    ItemLevel;                                               // 0x0058(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRepresentationType                                    ItemType;                                                // 0x005C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ELootTier                                                  LootTier;                                                // 0x005D(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EUIItemBackgroundStyle                                     BackgroundStyle;                                         // 0x005E(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemRarity                                                Rarity;                                                  // 0x005F(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMeleeWeaponDurability                                     WeaponDurability;                                        // 0x0060(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AXHR[0x7];                                   // 0x0061(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.MaxStaminaAttributeTypeAndInitialSettings
	 * Size -> 0x0070
	 */
	struct FMaxStaminaAttributeTypeAndInitialSettings
	{
	public:
		class UMaxStaminaAttributeType*                            AttributeType;                                           // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAttributeInitialSettings                           InitialSettings;                                         // 0x0008(0x0068) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct DeadIsland.CharacterContextTargetQueryParams
	 * Size -> 0x0040
	 */
	struct FCharacterContextTargetQueryParams
	{
	public:
		class UKnowledgeBaseComponent*                             RequesterKnowledgeBaseComponent;                         // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class APlayerController*                                   RequesterPlayerController;                               // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U8YQ[0x30];                                  // 0x0010(0x0030) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.QueryResultSummary
	 * Size -> 0x0080
	 */
	struct FQueryResultSummary
	{
	public:
		bool                                                       bValid;                                                  // 0x0000(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DIMT[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCharacterContext*                                   CharacterContext;                                        // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTargetPointInfo                                    TargetPointInfo;                                         // 0x0010(0x0050) BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOwnerOnScreen;                                          // 0x0060(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CVUM[0x3];                                   // 0x0061(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ScreenSpaceOverlapScoreNormalized;                       // 0x0064(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           OwnerScreenSpaceDimensionsNormalized;                    // 0x0068(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           ScreenSpaceLocation;                                     // 0x0070(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KJSN[0x8];                                   // 0x0078(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct DeadIsland.CharacterContextSelectionCandidate
	 * Size -> 0x00E0
	 */
	struct FCharacterContextSelectionCandidate
	{
	public:
		bool                                                       bHasVictimKBConditions;                                  // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UGXI[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseExpression                            VictimKBConditions;                                      // 0x0008(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bHasRequesterKBConditions;                               // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OFOD[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKnowledgeBaseExpression                            RequesterKBConditions;                                   // 0x0048(0x0038) Edit, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic
